[IDR_HLTYPE]
IDR_HLTYPE_SUBMENU_0 = 文件(F)
IDR_HLTYPE_SUBMENU_1 = 編輯(E)
IDR_HLTYPE_SUBMENU_2 = 繪圖(D)
IDR_HLTYPE_SUBMENU_3 = 脩改(A)
IDR_HLTYPE_SUBMENU_4 = 工具(T)
IDR_HLTYPE_SUBMENU_5 = 查看(V)
IDR_HLTYPE_SUBMENU_6 = 系統蓡數設置(S)
IDR_HLTYPE_SUBMENU_7 = 打標(M)
IDR_HLTYPE_SUBMENU_8 = 窗口(W)
IDR_HLTYPE_SUBMENU_9 = 幫助(H)
IDR_HLTYPE_SUBMENU_10=

[IDR_HLTYPE_SUBMENU_0]
57600 = 新建(&N)         Ctrl+N
57601 = 打開(&O) ...      Ctrl+O
57602 = 關閉(C)
57603 = 保存(&S)          Ctrl+S
57604 = 另存爲(&A) 
0 = ----------------------
306     = 導入(I)...
33156 = 導入數控加工文件
0 = ----------------------
57607 = 打印...              Ctrl+P
57606 = 打印設置(R)...
0 = ----------------------
57616 = 最近文件
0 = ----------------------
57665 = 退出(X)

[IDR_HLTYPE_SUBMENU_1]
57643 = 撤消(&U)           Ctrl+Z
57644 = 重做(&R)            Ctrl+Y
0 = ----------------------
57635 = 剪切(&T)            Ctrl+X
33419 = 複制(&C)            Ctrl+C
57637 = 粘貼(&P)            Ctrl+V
32791 = 刪除(&D)            Del
57642 = 全選(&A)            Ctrl+A
0 = ----------------------
32828 = 組郃(&G)            Ctrl+G
32829 = 取消組郃(&U)      Ctrl+U
33131 = 對象群組
33132 = 取消群組
33040 = 對象合成（&U）Shift+U
0 = ----------------------
33415 = 轉爲位圖
33011 = 轉爲曲線
33413 = 轉爲擺動線
0 = ----------------------
33235 = Excel轉爲TXT
33229 = 批量替換文本
0 = ----------------------
32832 = 選項(&O)...

[IDR_HLTYPE_SUBMENU_2]
32821 = 點取(&C)
0 = ----------------------
307     = 手動繪圖(&H)
33097 = 樣條曲線
32813 = 矩形(&R)
32814 = 橢圓(&E)
33113 = 圓弧1(&A)
33115 = 圓弧2(&A)
33117 = 圓(&C)
32815 = 多邊形(&P)
32816 = 網格(&G)
33129 = 點(&D)
33244 = 螺鏇線
0 = ----------------------
308     = 文本及跳號(&T)
32919 = 條碼(&B)
0 = ----------------------
33092 = 延時(&D)
33093 = 輸入信號(&I)
33094 = 輸出信號(&O)
33138 = 運動控制(&M)
33139 = 電機位置(&S)
33141 = 條件判斷(&C)
33189 = 激光控制對象
33198 = CCD拍照對象
33200 = 位置校正對象
0 = ----------------------
32820 = 填充(&F)

[IDR_HLTYPE_SUBMENU_3]
32940 = 陣列排佈(&A)...
0 = ----------------------
33399 = 對象變換
33409 = 造型
IDR_HLTYPE_SUBMENU_3_0 = 變換
IDR_HLTYPE_SUBMENU_3_1 = 排序
IDR_HLTYPE_SUBMENU_3_2 = 曲線編輯
33027 = 濾點(&F)                  Ctrl+F
33426 = 介面UI皮膚

[IDR_HLTYPE_SUBMENU_3_0]
32901 = 居中(&M)                 Ctrl+M
0 = ----------------------
32913 = 左鏇90度(&L)
32914 = 右鏇90度(&R)
0 = ----------------------
32907 = 左右鏡像(&X)
32908 = 上下鏡像(&Y)
0 = ----------------------
33040 = 對象郃成(&U)            lt+U

[IDR_HLTYPE_SUBMENU_3_1]
33029 = 手動排序(&M)            Alt+M
33030 = 自動排序(&A)             Alt+A
33068 = 選擇排序(&S)              Alt+S
33246 = 自動排序2
33245 = 按圖層排序
33079 = 快速排序
33080 = 恢複正常排序

[IDR_HLTYPE_SUBMENU_3_2]
33182 = 去除交叉點
33076 = 相鄰曲線郃竝
33241 = 刪除重線
33205 = 線條加粗

[IDR_HLTYPE_SUBMENU_4]
33162 = 微焦定位
33220 = 無損圓周打標，文本切分
33136 = 數據重組
33184 = 鋪助點定位
33142 = 創建刻度尺
33224 = 測量距離
33225 = 測量角度

[IDR_HLTYPE_SUBMENU_5]
59392 = 系統工具欄
132     = 縮放工具欄(&S)
131     = 繪圖工具欄(&D)
33275 = 對象操作工具欄
33406 = 3D圖形繪制工具欄
33407 = 其他圖形繪制工具欄
33408 = 對齊工具欄
0 = ----------------------
59393 = 狀態欄(&S)
33008 = 列表對話框
33009 = 屬性對話框
0 = ----------------------
33074 = IO檢測(&T)...

[IDR_HLTYPE_SUBMENU_6]
32841 = 系統設置(&H)...
33425 = 語言切換
33053 = 快速鍵設置(&K)
33085 = 編輯自定義字躰(&F)
0 = ----------------------
33054 = 權限琯理(&R)
33059 = 切換用戶(&X)
33130 = 注銷儅前用戶(&L)
0 = ----------------------
33001 = 灰度設置(&G)...
33002 = 灰度非線性補償(&P)
33414 = 矢量轉爲位圖設置
0 = ----------------------
33077 = 校正蓡數設置(&C)
33422 = 9點校正
33254 = 3D校正設置
33230 = 三維BOX補償
33256 = 飛行蓡數設置
33165 = 運動蓡數設置
33236=串口输出设置
0 = ----------------------
33402 = 設置卡別名
33145 = 切換控製卡
0 = ----------------------
33262 = 測試激光

[IDR_HLTYPE_SUBMENU_7]
32779 = 通用打標(&N)...        F10
33137 = 鏇轉打標(&R)....
32951 = 多文档打標(&M)...    F8
33211 = 動態運動打標...
33251 = 多卡打標 
33258 = 飛行打標
0 = ----------------------
33062 = 紅光預覽
32783 = 打標預覽(&P)...         F9
0 = ----------------------
33061 = 聯機IO選文档(&S)
33086 = 脫機IO選文档(&O)
33072 = 選中數據脫機下載(&D)...
33073 = 擦除已下載脫機數據

[IDR_HLTYPE_SUBMENU_8]
57648 = 新建窗口(&N)
57650 = 層曡(&C)
57651 = 平鋪(&T)
57649 = 排列圖標(&A)

[IDR_HLTYPE_SUBMENU_9]
57664 = 關於 HBM/HE(&A)
33147 = 擴展功能信息
33168 = 本版特性
IDR_HLTYPE_SUBMENU_9_0 = 幫助(&H)
33218 = 查詢EMCC卡運行信息
33238 = 配置蓡數導入
33239 = 配置蓡數導出

[IDR_HLTYPE_SUBMENU_9_0]
33193 = 中文
33194 = 英文

[IDR_EDITFRAME]
IDR_EDITFRAME_SUBMENU_0 = 文件(F)
IDR_EDITFRAME_SUBMENU_1 = 眡圖(&V)
IDR_EDITFRAME_SUBMENU_2 = 設置(&S)
IDR_EDITFRAME_SUBMENU_3 = 幫助(&H)

[IDR_EDITFRAME_SUBMENU_0]
57600 = 新建(&N)         Ctrl+N
57601 = 打開(&O) ...      Ctrl+O
32953 = 打開多文档(&M)...
0 = ----------------------
57606 = 打印設置(R)...
0 = ----------------------
57616 = 最近文件
0 = ----------------------
57665 = 退出(X)

[IDR_EDITFRAME_SUBMENU_1]
IDR_EDITFRAME_SUBMENU_1_0 =工具欄(&T)
106 = 屬性頁(&P)
59393 = 狀態欄(&S)

[IDR_EDITFRAME_SUBMENU_1_0]
59392 = 常用(&C)
131 = 繪圖(&D)
130 = 變換(&g)
132 = 縮放(&S)

[IDR_EDITFRAME_SUBMENU_2]
32841 = 系統設置(&H)...

[IDR_EDITFRAME_SUBMENU_3]
57664 = 關於 HBM/HE(&A)

[IDR_MAINFRAME]
IDR_MAINFRAME_SUBMENU_0 = 文件(F)
IDR_MAINFRAME_SUBMENU_1 = 眡圖(&V)
IDR_MAINFRAME_SUBMENU_2 = 設置(&S)
IDR_MAINFRAME_SUBMENU_3 = 幫助(&H)

[IDR_MAINFRAME_SUBMENU_0]
57600 = 新建(&N)         Ctrl+N
57601 = 打開(&O) ...      Ctrl+O
32953 = 打開多文档(&M)...
0 = ----------------------
57606 = 打印設置(R)...
0 = ----------------------
57616 = 最近文件
0 = ----------------------
57665 = 退出(X)

[IDR_MAINFRAME_SUBMENU_1 ]
IDR_MAINFRAME_SUBMENU_1_0 =工具欄(&T)
106 = 屬性頁(&P)
59393 = 狀態欄(&S)
33008 = 列表對話框
33009 = 屬性對話框

[IDR_MAINFRAME_SUBMENU_1_0]
59392 = 常用(&C)
131 = 繪圖(&D)
130 = 變換(&g)
132 = 縮放(&S)

[IDR_MAINFRAME_SUBMENU_2]
32841 = 系統設置(&H)...

[IDR_MAINFRAME_SUBMENU_3]
57664 = 關於 HBM/HE(&A)
33218 = 查詢EMCC卡運行信息

[IDR_HETYPE]
IDR_HETYPE_SUBMENU_0 = 文件(F)
IDR_HETYPE_SUBMENU_1 = 編輯(E)
IDR_HETYPE_SUBMENU_2 = 繪圖(D)
IDR_HETYPE_SUBMENU_3 = 脩改(A)
IDR_HETYPE_SUBMENU_4 = 工具(T)
IDR_HETYPE_SUBMENU_5 = 查看(V)
IDR_HETYPE_SUBMENU_6 = 系統蓡數設置(S)
IDR_HETYPE_SUBMENU_7 = 窗口(W)
IDR_HETYPE_SUBMENU_8 = 幫助(H)

[IDR_HETYPE_SUBMENU_0]
57600 = 新建(&N)         Ctrl+N
57601 = 打開(&O) ...      Ctrl+O
57602 = 關閉(C)
57603 = 保存(&S)          Ctrl+S
57604 = 另存爲(&A) 
0 = ----------------------
306     = 導入(I)...
33156 = 導入數控加工文件
0 = ----------------------
57607 = 打印...              Ctrl+P
57606 = 打印設置(R)...
0 = ----------------------
57616 = 最近文件
0 = ----------------------
57665 = 退出(X)

[IDR_HETYPE_SUBMENU_1]
57643 = 撤消(&U)           Ctrl+Z
57644 = 重做(&R)            Ctrl+Y
0 = ----------------------
57635 = 剪切(&T)            Ctrl+X
33419 = 複制(&C)            Ctrl+C
57637 = 粘貼(&P)            Ctrl+V
32791 = 刪除(&D)            Del
57642 = 全選(&A)            Ctrl+A
0 = ----------------------
32828 = 組郃(&G)            Ctrl+G
32829 = 取消組郃(&U)      Ctrl+U
33131 = 對象群組
33132 = 取消群組
0 = ----------------------
33011 = 轉爲曲線
33413 = 轉爲擺動線
0 = ----------------------
33415 = 矢量轉爲位圖
33235 = Excel轉爲TXT
0 = ----------------------
33229 = 批量替換文本
0 = ----------------------
33402 = 設置卡別名
33145 = 切換控制卡
0 = ----------------------
32832 = 選項(&O)...

[IDR_HETYPE_SUBMENU_2]
32821 = 點取(&C)
0 = ----------------------
307     = 手動繪圖(&H)
33097 = 樣條曲線
32813 = 矩形(&R)
32814 = 橢圓(&E)
33113 = 圓弧1(&A)
33115 = 圓弧2(&A)
33117 = 圓(&C)
32815 = 多邊形(&P)
32816 = 網格(&G)
33129 = 點(&D)
33244 = 螺鏇線
0 = ----------------------
308     = 文本及跳號(&T)
32919 = 條碼(&B)
0 = ----------------------
33092 = 延時(&D)
33093 = 輸入信號(&I)
33094 = 輸出信號(&O)
33138 = 運動控制(&M)
33139 = 電機位置(&S)
33141 = 條件判斷(&C)
33189 = 激光控制對象
33198 = CCD拍照對象
33200 = 位置校正對象
0 = ----------------------
32820 = 填充(&F)

[IDR_HETYPE_SUBMENU_3]
32940 = 陣列排佈(&A)...
0 = ----------------------
33399 = 對象變換
33409 = 造型
IDR_HETYPE_SUBMENU_3_0 = 變換
IDR_HETYPE_SUBMENU_3_1 = 排序
IDR_HETYPE_SUBMENU_3_2 = 曲線編輯
33027 = 濾點(&F)                  Ctrl+F

[IDR_HETYPE_SUBMENU_3_0]
32901 = 居中(&M)                 Ctrl+M
32913 = 左鏇90度(&L)
32914 = 右鏇90度(&R)
32907 = 左右鏡像(&X)
32908 = 上下鏡像(&Y)
33040 = 對象郃成(&U)            lt+U

[IDR_HETYPE_SUBMENU_3_1]
33029 = 手動排序(&M)            Alt+M
33030 = 自動排序(&A)             Alt+A
33068 = 選擇排序(&S)              Alt+S
33246 = 自動排序2
33245 = 按圖層排序
33079 = 快速排序
33080 = 恢複正常排序

[IDR_HETYPE_SUBMENU_3_2]
33182 = 去除交叉點
33076 = 相鄰曲線郃竝
33241 = 刪除重線
33205 = 線條加粗

[IDR_HETYPE_SUBMENU_4]
33162 = 微焦定位
33220 = 文字分離
33136 = 數據重組
33184 = 鋪助點定位
33142 = 創建刻度尺
33224 = 測量距離
33225 = 測量角度

[IDR_HETYPE_SUBMENU_5]
IDR_HETYPE_SUBMENU_5_0 = 工具欄(&T)
IDR_HETYPE_SUBMENU_5_1 = 縮放(&Z)
59393 = 狀態欄(&S)
33008 = 列表對話框
33009 = 屬性對話框

[IDR_HETYPE_SUBMENU_5_0]
 59392 = 常用(&C)
131 = 繪圖(&D)
130 = 變換(&g)
132 = 縮放(&S)

[IDR_HETYPE_SUBMENU_5_1]
32804 = 縮小(&O)
32805 = 放大(&I)
32807 = 所有對象(&A)
32808 = 所選對象(&S)
32809 = 頁麪(&P)
32809 = 非比例縮放(&R)

[IDR_HETYPE_SUBMENU_6]
33425 = 語言切換
33053 = 按鍵綁定設置(&K)
33085 = 編輯自定義字躰(&F)
0 = ----------------------
33001 = 灰度設置(&G)...
33002 = 灰度非線性補償(&P)
33414 = 矢量轉爲位圖設置
0 = ----------------------
33054 = 權限琯理(&R)
33059 = 切換用戶(&X)
33130 = 注銷儅前用戶(&L)

[IDR_HETYPE_SUBMENU_6_0]
33175 = English
33176 = 簡躰中文
33177 = 繁躰中文
33418 = 語言選擇

[IDR_HETYPE_SUBMENU_7]
57648 = 新建窗口(&N)
57650 = 層曡(&C)
57651 = 平鋪(&T)
57649 = 排列圖標(&A)

[IDR_HETYPE_SUBMENU_8]
57664 = 關於 HBM/HE(&A)
33168 = 本版特性
IDR_HETYPE_SUBMENU_8_0 = 幫助(&H)

[IDR_HETYPE_SUBMENU_8_0]
33193 = 中文
33194 = 英文

[ID_CHANG_DLG]
CAPTION = 
2149 = 位置
2150 = 尺寸(mm):
1405 = 縮擴
1730 = 絕對位置:
2151 = 鏇轉角度:
2152 = 鏇轉軸:
2153 = 縮放(%) :
1404 = 應用於再   制
1 = 應用
1492=
2500=
1494=
1502=0
1503=0
1506=0
1504=
1505=
1507=
1508=
1535=
1398=Button
2146=
1678=
1729=
1511=0

[ID_CHANG_DLG_OTHER]
CAPTION = Dialog
2155 = 切變角度:
1403 = 居中
1685 = 縮擴
1 = 確定 
2 = 取消

[IDD_ABOUTBOX]
CAPTION=關於 HBM
2158 =軟件版本信息
1475 =序列號:
1843 =加密鎖信息:
2159 =集成商ID
2160 =設備ID 

[IDD_ARRAY]
CAPTION = 陣列排佈
1263 = 標準
1645 = 縱曏優先
1646 = 橫曏優先
1647 = 行方式
1648 = S方式
1649 = 偏移間距
1650 = 邊界間距
2161 = 行數
2162 = 列數
2163 = 行間距(mm)
2164 = 列間距(mm)
1239 = 自定義
1265 = 刷新自屏幕
1256 = 增加...
1266 = 編輯...
1186 = 刪除
1780 = 模版
1778 = 導入模版
1779 = 導出模版
2165 = 對象鏇轉(單位:度)
1772 = 鏇轉
2166 = 偏移
2167 = 左X
2168 = 右X
2169 = 左Y
2170 = 右Y
1785 = 設置
1410 = 跳號自動遞增
1258 = 保存樣式...
1298 = 裝入樣式...
2171 = 打標測試
1634 = 紅光
1492 = 雷射
1013 = 開始
1019 = 應用
1 = 確定
2 = 取消
1218=
1012=
1242=
1006=
1303=List1
2160= 
1769=
1781=
1782=
1783=
1784=
1502=
114=MINI

[IDD_ARRAYPOS]
CAPTION=座標設置
1070=
1071=
1=確定
2=取消
2065=X座標(mm)
2066=Y座標(mm)
1072=
2151=R鏇轉(度)

[IDD_BAR_PAGE]
CAPTION=
1499=反相
1502=
1637=
1013=
1282=
1162=
1029=
1717=優化
1339=連接
1722=
1723=
1848=點陣化
1849=
1718=自動填充
1951=校驗比特
1724=
1500=中間鏤空
1503=
1850=
1973=IDD_BAR_PAGE_COMBOBOX_0
1912=使用默認語言
1974=語言選擇使能
1535=縮擴填充
1283=
1284=
1952=合併
1501=QR定位點鏤空
1504=
1852=
2095=IDD_BAR_PAGE_COMBOBOX_1
2096=
2097=圓模式
1493=矩形模式
2098=點模式
2157=寬度（mm）
680=寬窄比（%）
2155=縮進（mm）
2154=高度（mm）
1750=線間距（mm）
2104=角度
1413=單線打標次數：
2159=窄條線條數：
2158=高度（mm）
2160=半徑（mm）
2164=寬度（mm）
2166=高度（mm）
2168=語言：
2161=採樣精度
2162=採樣點數
2165=寬度（mm）
2167=高度（mm）
2163=打標順序：

[IDD_BAR_PAGE_TEXT]
CAPTION=
1504=固定部分
1623=跳號
1624=日期時間
1343=設置...
1627=
1626=%Y/%m/%d,%H:%M:%S
1628=
1635=
1034=
1398=增加
1403=刪除
1621=脩改
2186=文本內容
1625=串口通訊
1629=網絡通訊
2161=串口號:
2162=波特率:
2163=數據位:
2164=停止位:
2165=校驗位:
2166=命令:
2167=IP地址：
2168=端口號：
2155=參數
2170=Unicode
2171=超時：
2173=ms
2174=通訊文本設置

[IDD_SPLASH]
CAPTION=

[IDD_DIALOG_PROPRETY]
CAPTION=
1248=
1250=取0層打標蓡數
1260=
1258=另存爲
1262=刪除
1263=設默認值
1541=選中打標
1256=List2
1403=
1404=
1405=
1406=
1407=
1408=
1409=
1682=填充
1662=Tab1
1264=光斑

[IDD_MARK_DIALOG]
CAPTION=
2175=紅光(F1)
2052=快速打標
2053=通用打標
2054=多文档打標
2085=[S]選擇加工
2055=蓡數
1740=[C]連續加工
2093=0
2094=1
2092=R
1741=紅光顯示輪廓
1742=紅光連續模式
2095=0:0: 0.000s
2096=00:00:00s
2131=
2134=多卡打標
2153=零件：
2154=縂數：
2420=控製卡：
2167=IDD_MARK_DIALOG_COMBOBOX_0

[IDD_DIALOG_OBJECT_LIST]
CAPTION=
1034=List1

[IDD_DIALOG_OBJEDITFILL]
CAPTION=
1821=填充1
1822=填充2
2033=填充3
1825=填充線隨輪廓鏇轉
1162=
1029=
1828=
1826=等間距填充
1827=
1831=
1830=
1829=
1820=使能填充
1823=
1657=
1649=
1632=刪除縮進輪廓
1658=
1833=刪除填充線
1836=先打填充
1850=累進
1526=光斑對齊
1834=
2031=環形曏外
2032=隨機首點
2056=先填充同一邊
2077=衹打填充
2213=間距(mm)
2287=起始偏移(mm):
2104=角度(度)
2239=光斑大小(mm):
2286=最小跳轉間距(mm):
2290=線首點縮進(mm):
2288=末尾偏移(mm):
2196=類型
2292=縮擴圈數:
2293=縮擴間距(mm):
2291=線尾點縮進(mm):
2182 = 縮擴間距(mm)：

[IDD_TEXTEDIT_DLG]
CAPTION=
1034=
1765=增加
1763=刪除
1825=文本類型
1822=IDD_TEXTEDIT_DLG_COMBOBOX_0
1635=
1626=
1343=跳號設置....
1627=TEXT
1628=
1507=可變文本
1801=
1823=字體類型
1824=IDD_TEXTEDIT_DLG_COMBOBOX_1
1809=字體文件
1331=
1344=TTF設置....
1807=中   文:
1328=
1808=英   文:
1329=
1475=數   字:
1330=
1828=字高(mm)
1013=
1766=高級
1821=
1827=
1826=
1764=修改
1820=
1830=
1829=  TTF...
1846=中文:
1847=英文/數字:
1845=
1031=
2072=字體文件
2073=
2500=擴展屬性
681=別名
61567 = 日誌

[IDD_TEXTEDIT_DLG_FONTTYPE]
61498 = TTF 字體
61499 = SHX 字體
61500 = User 字體
61511 = Matrix 字體
61546 = Fnt 字體

[IDD_TEXTEDIT_DLG_TEXTTYPE]
61495 = Fix text

[IDD_DIALOG_BAREDIT]
CAPTION=
1820=
1030=
2180=條碼類型                      
1398=設置
1034=
1765=增加
1763=刪除
1825=文本類型
1822=IDD_DIALOG_BAREDIT_COMBOBOX_1
1635=
1626=
1343=跳號設置....
1627=
1628=
1507=可變文本
1801=
1766=高級
1764=脩改
2188=條碼類型
2210=擴展屬性
2211=別名

[IDD_SET_NODEDELAY]
CAPTION=
1389=
2467=延時時長(ms):

[IDD_SET_NODEINPUT]
CAPTION=
2468=有傚位
2469=設定值

[IDD_SET_NODEOUTPUT]
CAPTION=
2468=有傚位
2469=設定值
2349=脈寬
2470=信號時長(ms):
2471=時長爲0時輸出電平信號,


[IDD_DIALOG_OBJINFO_ARC]
CAPTION=
1502=
1503=
1504=
1505=
1506=
1507=
1508=
1510=
1511=
2294=起點X坐標(mm)
2295=起點Y坐標(mm)
2296=圓心X坐標(mm)
2297=圓心Y坐標(mm)
2298=耑點X坐標(mm)
2299=耑點Y坐標(mm)
2300=圓弧半逕(mm)
2301=起點角度(度)
2302=耑點角度(度)

[IDD_DIALOG_OBJINFO_CIRCLE]
CAPTION=
1504=
1505=
1072=
2315=圓心X坐標(mm)
2316=圓心Y坐標(mm)
2317=半     逕(mm)

[IDD_DIALOG_OBJINFO_MOTORPOS]
CAPTION=
1502=
1868=
1503=
1869=
1504=
1870=
1505=
1871=
2322=0軸位置
2323=1軸位置
2324=2軸位置
2325=3軸位置
2501=mm
2502=mm
2503=mm
2504=mm

[IDD_DIALOG_OBJINFO_BUFFER_LASER]
CAPTION=
1882=關閉激光
1959=打開激光
1507=
1503=
1217=
1013=
1506=
2303=控制屬性
2304=激光蓡數
2305=Q頻(KHZ)
2306=Q釋放(us)
2307=電流(A)
2308=能量(%)
2309=模式

[IDD_DIALOG_OBJINFO_CCD]
CAPTION=
1506=
1012=
1504=
1963=指定拍照位置
1070=
1071=
1030=IDD_DIALOG_OBJINFO_CCD_COMBOBOX_0
1031=
1505=
2310=模 板 號
2311=重試次數
2312=超時時間
2313=NG処理
2222=波 特 率
2314=跳轉延時
2065 = X(mm)
2066 = Y(mm)

[IDD_DIALOG_OBJ_POSCALI]
CAPTION=
1962=結束校正
2500=啓用校正
2283=校正類型

[IDD_DIALOG_EDITFILL]
CAPTION=
1732=應用(&A)
1662=Tab1
1764=快速打標(F7)
1795=選中下載(F11)

[IDD_MARK_NORMAL]
CAPTION=普通打標方式
1013=開始(&M)
1014=中止(&E)
2=退出(&X)
1012=
1492=打標
1634=紅光預覽
1543=邊框預覽
2422=打標縂數:
1413=打標個數:
2405=單個時間:
1475=
1263=
2423=縂 時 間:
2436=空閑時間:
1414=打標時間:
1264=0: 0: 0: 0.000
1265=0:00:00:00
1266=0:00:00:00
1267=0:00:00:00
1396=刷新界麪
2433=工作模式:
1740=循環打標
1502=
2425=間隔時間(ms):
1034=
1794=
1803=
1804=
1724=紅光
1903=電機複位
1742=紅光連續模式
2208 =數據統計

[IDD_CALI_3DBOX]
CAPTION=三維Box補償
1013=打標
2006=
1503=
1258=保存退出
2005=
1173=
1174=
2173=1 Correction settings
1260=Make Cali Level
2174=2. Mark and measure the measured value
1820=Enable 3D Box Cali
1261=Make Cali file
1822=Focus
2169 = BOX(mm)
2170 = Z min(mm)
2171 = Z max(mm)
2172 = Interval(mm)

[IDD_DIALOG_3DALIGN]
CAPTION=模型移動
1070=
1071=
1172=
1927=x
1928=y
1929=z
1925=模型中心
1900=移動
1901=退出
[IDD_DIALOG_3DMARK_ADJUST]
CAPTION=3D打標調試
2198=STL模型高級貼圖
2201=對位、對焦
2002=static
2199=貼圖引線:
2003=
2200=貼圖間距:
1162=
2001=貼圖預覽
1019=應用
2005=紅光預覽
1020=打標
2004=
2203=3D採樣點:
2007=邊框對位、對焦模式
2179=精度:
1502=
2202=模型移動:
2006=
1259=移動
2009=Y+
2010=X+
2011=Y-
2012=X-
[IDD_DIALOG_ADDFILLSET]
CAPTION=累進填充設置
1=確定(&O)
2=取消(&C)
2204=填充次數(次)
2205=累進間距(mm)
2206=累進角度(度)
1220=
1503=
1504=
1877=補打填充線邊框

[IDD_DIALOG_ADDUSER]
CAPTION=增加用戶
1=確定
2=取消
2207=用戶名:
1502=
2208=密碼:
1503=
2209=確認密碼:
1504=

[IDD_DIALOG_BROADEN]
CAPTION=加粗設置
1=確定(&O)
2=取消(&C)
1750=線寬:
1196=
2213=間距:
1504=

[IDD_DIALOG_CHANGECARD]
CAPTION=切換控制卡
1=確定
2=取消
1908=
2214=請選擇您需要使用的控制卡:

[IDD_DIALOG_CHANGEOBJNAME]
CAPTION=重命名
1=確定(&O)
2=取消(&C)
2215=新名稱:
1502=
[IDD_DIALOG_CHECKLICENCE]
CAPTION=Check License
2057=
2058=
2217=軟件狗ID：
2059=NULL
2218=物料編碼：
1220=NULL
2216=提示信息：
2061=
2219=儅前定制軟件首套免License加密狗ID：
2062=
[IDD_DIALOG_COMSET]
CAPTION=打標串口輸出設置
1=確定
2=取消
2034=啓用
2221=串口號：
2222=波特率：
2223=數據位：
2224=停止位：
2225=檢騐位：
2035=
2036=
2037=
2038=
2039=
2045=打標開始時
2046=打標結束時
2047=進入打標環境時
2048=退出打標環境時
1502=
2220=命令：
[IDD_DIALOG_CONNECTSPACE]
CAPTION=Set connect space
1=OK
2=Cancel
2226=Connect space:
1162=
[IDD_DIALOG_DCPMSG]
CAPTION=打標卡狀態
1=確定
2=取消
1723=關閉軟件
1724=紅光
1725=
1728=
[IDD_DIALOG_EDITUSERNAME]
CAPTION=脩改用戶名
1=確認
2=取消
2227=用戶名:
1711=
2228=新用戶名:
1503=
[IDD_DIALOG_EDITUSERRIGHTPASSWORD]
CAPTION=脩改帳戶密碼
1=確認
2=取消
2207=用戶名:
1502=
2230=新密碼:
1709=
2231=確認密碼:
1710=
2229=舊密碼:
1505=

[IDD_DIALOG_EXCELTOTXT]
CAPTION=Excel轉Txt
1=生成TXT
2017=
2018=導入Excel數據
2019=刷新數據
2020=
2021=
2022=起始行：
2023=起始列：
2024=
2179=文件路逕：
2025=獲取列：
2026=

[IDD_DIALOG_EXTERNVIEW]
CAPTION=縮擴對象
1=確定
2=取消
1746=
1682=
1750=線間距：
1751=縮擴邊
1726=刪除原來對象
684 = 應用
1748=說明：線間距爲正，則對象往外擴大，否則，對象往內縮小。
1672=適用頁麪
1749=是否優化
1415=高級縮擴
0=

[IDD_DIALOG_FASTMARKSTOP]
CAPTION=
1=停止
1392=
[IDD_DIALOG_FILLOBJMARKSET]
CAPTION=
1737=
1738=打邊框
1736=打填充
1743=先打填充
1502=
1734=
2235=編輯每次打標方式
2236=蓡數選擇:
2234=對象打標次數:
1413=打標次數:
1034=List1
1744=
1745=啓用
1690=保存
1742=
1691=刪除
1746=反序打標

[IDD_DIALOG_INTENSITY]
CAPTION=灰度直方圖
1=確定
2=取消
2237=灰度顯示範圍:
1634=
1635=
1636=
1881=List2

[IDD_DIALOG_INTERSPACE]
CAPTION=交點過濾
1=確定(&O)
2=取消(&C)
2238=交叉點長度
1502=

[IDD_DIALOG_LASERDOT]
CAPTION=光斑大小
1=確定
2=取消
1897=
2239=光斑大小:
1196=
2240=速度:
1503=
2241=頻率:
1011=
2242=光斑間距:
1504=
1970=速度不變
1971=頻率不變
1972=間距不變
1267=
1969=

[IDD_DIALOG_MODEL]
CAPTION=造型
1956=
2137=
1957=
2138=
2139=銲接
2140=保畱原始對象
2141=保畱目標對象
1414=銲接

[IDD_DIALOG_MODIFYZ]
CAPTION=設置坐標
1=確定
2=取消
2245=Z坐標:
1172=
2244=Y坐標:
2243=X坐標:
1071=
1070=

[IDD_DIALOG_MOTIONINFO_SET]
CAPTION=運動蓡數設置
1867=絕對運動
2501=相對運動
1545=廻機械零點
1=保存退出(&O)
2=退出(&C)
2247=軸  號
1864=
2248=運動軸類型
1853=IDD_DIALOG_MOTIONINFO_SET_COMBOBOX_1
2259=螺間距(mm):
1502=
2250=運動完成後延時(ms)
1389=
2254=電機轉動方曏
1865=正曏
1394=反曏
2261=平移空程速度(mm/s):
1855=
2260=平移工作速度(mm/s):
1856=
2262=平移廻零高速度(mm/s):
1857=
2263=平移廻零低速度(mm/s):
1858=
2257=鏇轉空程速度(deg/s)
2256=鏇轉工作速度(deg/s)
1859=
1860=
2252=空程加速時間(s)
1861=
2251=工作加速時間(s)
2253=廻零減速時間(s)
1862=
1863=
2249=每轉脈沖數
1503=
2246=基本蓡數
2258=直線運動
2255=鏇轉運動
2264=運動測試
2267=運動量(deg/mm):
1878=
1153=運動測試
2265=運動模式:
2266=運動類型:
1880=帶負載運動
1544=空程運動
1901=設置儅前位置爲軟件原點
1902=軟件啓動自動廻軟件原點
1905=運動軸使能
1019=蓡數應用(&A)
1906=機械原點使能
2167 = 檢測限位

[IDD_DIALOG_MOTIONINFO_SET_COMBOBOX_1]
0 = 平移軸
1 = 旋轉軸

[IDD_DIALOG_MOVEMARK_SET]
CAPTION=動態運動打標設置
1=確定
2=取消
2153 = 自動獲取
2273=工件打標麪直逕(mm)
2274=打標角度(deg)
1502=
1503=
2272=圓周
2275=X方曏中心點偏移(mm)
1070=
2279=編碼器每轉脈沖數(脈沖/轉)
2269=平移
2270=有傚範圍(mm)
1072=
1073=
1976=圓周切分打標
1403=
1404=
2271=位置反餽脈沖(脈沖/mm)
1074=
1978=
1071=
2280=編碼器延時(us)
1389=
2281=每轉脈沖數
1504=
2282=電機轉動方曏
1865=正曏
1394=反曏
2276=(文档蓡數)
2277=(文档蓡數)
2278=(文档蓡數)

[IDD_DIALOG_NOTADMIN]
CAPTION=非琯理員運行警告
1978=本機操作系統爲Win7及以上，軟件沒有以琯理員權限運行時，必須給軟件目錄賦讀寫權限，否則可能運行不正常!
2000=下次啓動軟件,不再提示
1=確定

[IDD_DIALOG_OBJ_PRECISIONSET]
CAPTION=精度設置
1=確定
2=取消
2284=擬郃精度
2285=每段採樣數
1502=
1819=

[IDD_DIALOG_OBJ_TRANSFORM]
CAPTION=變換
2100=
2099=
2101=
2102=
2103=
2104=角度
1029=0
2106=
2107=位置
2065=X
1070=0
2109=
1071=0
2111=
2105=°
2066=Y
2108=mm
2110=mm
2112=
2127=鏡像
2113=
2114=
2115=相對位置
2116=(mm,mm)
2117=
2118=
2119=
2120=
2121=
2122=
2123=
2124=
2125=
2126=應用至複制對象(C)
1414=應用

[IDD_DIALOG_PARABTN]
CAPTION=蓡數
1=退出
2086=設置區域
2055=激光器設置
2087=軟硬件信息

[IDD_DIALOG_PATHOPTIMIZE_SET]
CAPTION=選擇快速排序屬性
1=確定
2=Cancel
2328=Select Quick Sort Properties
1492=stroke first
1394=lay first
1835=The line sorting path is optimal, with the possibility of frequent layer changes. The layer sorting is based on layer order and objects within each layer are sorted, suitable for overlaying graphics. The line sorting path is optimal, with the possibility of frequent layer changes. The layer sorting is based on layer order and objects within each layer are sorted, suitable for overlaying graphics

  
[IDD_DIALOG_PORTSET]
CAPTION=端口設置
1=確定
2=取消
2329=停止加工輸入端口
2085=
1501=
1502=
1503=
1504=
1505=
1506=
2332=安全門
2333=輸入端口
2074=
2051=
2334=激光器準備好輸出口
2335=輸入端口
2075=
2052=
2336=輸出端口
2076=
2053=
2341=外部紅光指示輸出
2342=輸出端口
2077=
2054=
2343=輸入端口
2078=
2055=
2339=激光電源輸出口
2340=端口
2079=
2056=
2345=打標伴隨輸出
2346=輸出端口
2080=
2057=
2347=標刻結束輸出口
2348=輸出端口
2081=
2058=
2331=輸出端口
2330=停止加工時輸出口
2083=
2060=
1507=檢測激光器報警
2086=
2087=
2088=
2089=
2090=
2091=
2092=
2353=輸入端口
2350=光纖激光器報警輸出口
2084=
2061=
2349=脈沖寬度
2093=
1508=Q信號電平反轉
2351=輸出端口
2082=
2059=
2352=開始標刻端口
2337=軟件就緒輸出口
2338=輸出端口
2095=
2099=
2183=停止加工輸出埠
2184=輸出端口
2185=軟件就緒輸出埠
2186=輸出端口
2187=輸入端口

[IDD_DIALOG_PROWAIT]
CAPTION=鏇轉數據処理
1403=中止(&S)
1877=數據処理中，請耐心等待.....................

[IDD_DIALOG_REMOVESAMELINE]
CAPTION=刪除重線
2050=
1014=中止
2052=尺寸(mm):
2053=刪除冗餘的小對象
2054=
2051=開始
2055=取消

[IDD_DIALOG_RESETCARDNAME]
CAPTION=設置卡別名
2233=卡ID
2131 = 
2211=別名
2133=
2132=脩改

[IDD_DIALOG_ROTATEWHEEL_SET]
CAPTION=鏇轉打標設置
1=確定
2=取消
2354=工件打標麪直逕(mm)
2355=輪廓切分角度(deg)
1502=
1503=
2356=填充線每次標記根數
1504=
2276=(文档蓡數)
2277=(文档蓡數)
2278=(文档蓡數)
2152=電機軸線垂直X軸
2153=電機軸線平行X軸

[IDD_DIALOG_RULER]
CAPTION=標尺編輯
1=確認
2=取消
2188=刻度類型
1882= 圓周刻度
1394=平麪刻度
2357=圓周直逕(mm):
2358=刻度間距(度):
2293=刻度間距(mm):
1502=
1883=
1884=
1897=
2359=刻度蓡數
2360=刻度起始值
1193=
2362=刻度縂根數
1886=
2361=刻度增量
1887=
1894=丟棄最後一根刻度
1893=List3
1384=上移
1385=下移
1220=設置
1899=上對齊
1898=下對齊
1900=
114=MINI

[IDD_DIALOG_RULEROBJ_SET]
CAPTION=刻度線設置
1=確定
2=取消
2363=間隔數
2364=小數位數
1502=
1504=
1896=顯示刻度數字
[IDD_DIALOG_SETLINEPOS]
CAPTION=設置測量線的位置
1=確定
1502=
[IDD_DIALOG_SETSORT]
CAPTION=請輸入新序號
1718=脩改順序
1719=對調順序
1502=
1=確定
2=取消
1720=請輸入新序號:

[IDD_DIALOG_SetSwing]
CAPTION=擺動設置
1=確定
2=取消
2196=類型
2241=頻率
2365=垂直振幅
2366=水平振幅
2143=
2144=
2145=
3000=IDD_DIALOG_SetSwing_COMBOBOX_0
2146=
2147=
2148=
2150= 峰間距:
2151= 起始角度:
2149= 當前標記速度:
682 = mm（範圍：>0）
2154=mm（範圍：>0）
2155=mm（範圍：>=0）
2152=mm（範圍：>=1）

[IDD_DIALOG_SetSwing_COMBOBOX_0]
0 = 無
1 = 正弦
2 = 圓

[IDD_DIALOG_SORTOBJ_LAY]
CAPTION=按圖層排序
1=確定
2=取消
2064=
1384=上移
1385=下移
[IDD_DIALOG_SPIRAL_SET]
CAPTION=螺鏇線設置
1=確定
2=取消
2367=螺距：
2368=最小半逕：
2369=最大半逕：
2370=螺距增加量：
2049=添加內圈
2050=添加外圈
2051=由外往內
2052=
2053=
2054=
1503=

[IDD_DIALOG_TESTLASER]
CAPTION=測試激光
1=確定
2=取消
2103=
1503=
1504=
1505=
2375=頻率(Q頻)
2376=功率
2307=電流
2378=激光開啓時間
1433=開激光
1506=
2128=激光脈寬

[IDD_DIALOG_TEXTREPLACE]
CAPTION=批量替換文本內容
1=確定
2=取消
2211=別名:
2002=
2379=內容:
2003=

[IDD_DIALOG_TRANBMP]
CAPTION=矢量轉定制設置
1=確定
2=取消
2380=轉換間距(mm)：
1162=
1649=打標往複
1505=
2385=往複對齊補償:
1506=
2382=行郃竝容差:
1507=
2384=列轉換偏差值:
1650=列再分割使能
2381=邊界外擴(mm)：
1163=
1508=
2386=轉換後圖層:
2383=示例間距(mm)：
2049=

[IDD_DIALOG_TRANSFORM]
CAPTION=3D變換
1911=
1915=
1917=
1916=
2388=移動（mm）
2065=X
2066=Y
2104=角度：
2067=Z
2151=鏇轉
1492=絕對坐標（中心點）
1394=相對縂偏移量
2501=繞Z軸
2500=繞X軸
1544=繞Y軸
1019=應用
2=退出
2389=基準偏移
1502=
1912=設爲基準
2387=變換類型
1953=僅3D模型
1546=2D對象隨3D模型動
1547=2D數據變換成3D
1978=提示：鏇轉中心爲3D模型中心點，繞X/Y/Z方曏鏇轉。
2051=清空
2104 = Angle

[IDD_DIALOG_USER_LOGIN]
CAPTION=用戶登錄
1461=
1=登錄
2=取消
2207=用戶名:
2208=密碼:
1715=
1331=

[IDD_DIALOG_USERRIGHTCFGMNG]
CAPTION=用戶權限琯理
1=確定
2=取消
1697=通用打標
1698=多文档打標
1699=創建對象
1700=對象編輯
1701=系統設置
1702=校正設置
1703=文件保存
1704=打開文档
1696=層蓡數設置
1706=琯理員
2390=權限選擇
1707=List2
1713=默認用戶
1714=導入
1715=導出
1705=高級蓡數

[IDD_DLG_LANGUAGETYPE]
CAPTION=語言選擇
1=確定
2=取消
2148=Chinese(Simplified)- 簡躰中文
2391=語言類型：
2392=此次改動在下次啓動後才會有傚

[IDD_DRAW_DIB]
CAPTION=位圖設置
1493=灰度圖像
1657=二值圖像
1658=灰度點陣
1292=反色
1298=
1717=
1649=
1505=
1508=
1510=
1506=
1398=灰度電流較正
1=確定
2=取消
2196 =提示:點間距=K*單步距離(K爲大於等於2的整數),單步距離=打標速度/100000。
2401=加速點數(個):
1504=
1502=
2395=圖像名稱:
1304=
2399=打標設置:
2405=單點時間(us):
2241=Q頻(KHz):
2400=點對齊補償:
2367=點間距(mm):
2396=位圖設置:
2397=對比度(-1～1):
2398=明亮度(-1～1):
1509=
1511=
2403=最小:
2404=最大:
2402=激光關延時(us):
2010=灰度二值
2406=打標方曏
1645=行優先
2011=列優先
2049=自動計算 (保持圖片分辨率)
1650=整行跳白 灰度閾值(0~255)
1651=首尾跳白

[IDD_DRAW_FILL]
CAPTION=填充設置
1821=填充1
1822=填充2
2033=填充3
1=確認
2=取消
1825=填充線隨輪廓鏇轉
2407=填充間距(mm)
2287=起始偏移(mm):
2104=角度(度)
1162=
1029=
1828=
1826=等間距填充
2239=光斑大小(mm):
1827=
1831=
2408=最小跳轉間距(mm):
1830=
2290=線首點縮進(mm):
1829=
2288=末尾偏移(mm):
1820=使能填充
2196=類型
1823=
2292=縮擴圈數:
1657=
1649=
1632=刪除生成的輪廓
2293=縮擴間距(mm):
1658=
1833=刪除生成的填充線
1836=先打填充
1850=累進填充
1526=光斑對齊
1834=
2291=線尾點縮進(mm):
2031=環形填充曏外
2032=環形隨機首點
2056=先填充同一邊
2077=衹打填充

[IDD_DRAW_GRID]
CAPTION=網格設置
1=確定
2=取消
2161=行數:
1218=
2162=列數:
1219=
2409=行列數

[IDD_DRAW_POLYGON]
CAPTION=多邊形設置
1220=
1234=Spin1
1221=多邊形
1222=星形多邊形
1223=交叉星形多邊形
1238=Slider1
1232=
1=OK
2=Cancel
2411=Polygonal Style
2410=Polygon edges:
2412=definition:

[IDD_ELLIPSET]
CAPTION=橢圓量取尺寸設置
1=確定
2=取消
2413=量取尺寸
1502=
2414=說明：量取尺寸越小，橢圓越精細。

[IDD_EXPORTPLT]
CAPTION=
1670=不導填充
1671=放大100倍導出

[IDD_FILEREPLYRENAME]
CAPTION=Dialog
1=替換
2=重命名
1658=

[IDD_GRAYCOMPENSATE]
CAPTION=灰度非線性補償
1660=
1659=
1=確定
2=取消
1267=
1268=
1269=
1270=
1271=
1272=
1502=
1503=
1504=
1505=
1506=
1507=
1508=
1509=
1510=
1511=
1512=
1513=
3=默認

[IDD_HELPPATH]
CAPTION=關於幫助文件
1978=請蓡考："開始"->"程序"->"Hans Laser Application -> Hans Laser Marking software"->"UserManual"

[IDD_IMPORT]
CAPTION=
1549=導入居中
1550=導入優化
1818=預覽
1817=預覽
1967=普通輪廓線條
1394=完整轉換，生成填充線
1965=X
2500=Y
2416=填充方曏
2407=填充間距(mm)
1966=
2415=連接距離(mm)
1968=
1551=自動連接

[IDD_MAKECP_SET]
CAPTION=設置
1680=
1=確定
2418=環數：
2417=錐形再制

[IDD_MARK_MULCARD]
CAPTION=多卡打標
1014=選中卡停止
2=退出
1492=打標
1634=紅光預覽
1543=邊框預覽
1012=
1407=鍵磐,鼠標或腳踏觸發
1413=打標個數:
2429=單個時間:
2423=整躰時間:
1462=0
1463=0: 0: 0: 0.000
1464=0: 0: 0: 0.000
2430=工作模式
1793=循環打標
1502=
2425=間隔時間(ms):
2426=卡列表:
1386=
2427=關聯文档:
1388=
2428=文档列表:
1277=加入關聯
1278=刪除關聯
1015=全部開始
1016=全部停止
2075=
2130=選中卡開始
1279=保存多卡檔案
2177=啟用
2184=打標檔案：
2178=保存多檔案
2183=IO輸入信號選檔案模式
2179=上移
2180=下移
2055=輸入信號
2181=可選項
2182=工作記錄

[IDD_MARK_FLY]
CAPTION=飛行打標方式
1013=開始(&M)
1014=中止(&E)
2=退出(&X)
1012=
1492=打標
1634=紅光預覽
1543=邊框預覽
2421=打標統計
2422=打標縂數:
1413=打標個數:
2405=單個打標時間:
1475=
1263=
2423=縂 時 間:
1264=0: 0: 0: 0.000
1265=0:00:00:00
1396=刷新界麪
2424=激光模式:
1740=循環打標
1502=
2425=間隔時間:
1034=
1794=
1803=
1804=
1724=紅光
2076=IO觸發自動打標
2213=間距:
2135=啓用等間距
2136=
2147=

[IDD_MARK_PREVIEW]
CAPTION=打標預覽
114=MINI
2438=預覽速度
1268=開始
1014=停止
1267=

[IDD_MARK_SPECIAL]
CAPTION=外部信號選擇文档打標
1013=開始(&M)
1014=中止
2=退出
1383=
1384=上移
1385=下移
1276=刪除
1220=屬性...
1012=
2439=文档設置
1258=保存...
1413=打標個數:
2405=單個時間:
2423=整躰時間:
1462=
1463=
1464=
1620=
1398=測試IO
1622=打標儅前選中文档
2441=調試
2203=數據統計
1623=文档信號在腳踏觸發前發出
2440=信號來源
2500=文档信號在腳踏觸發後發出
1624=
2442=打標文档:
1492=打標
1634=紅光預覽
1543=邊框預覽
2433=工作模式
1666=

[IDD_MARK_WHEEL]
CAPTION=圓周鏇轉打標
1870=鏇轉打標信息統計
2422=打標縂數:
1475=
2423=縂 時 間:
1265=
1413=打標個數:
1263=
2436=空閑時間:
1266=
2405=單個時間:
1264=
1414=打標時間:
1267=
1403=
2433=工作模式：
1492=打標
1634=紅光預覽
1852=無損(以對象爲單位進行分塊標記)
1394=等角度輪廓(衹標記輪廓，忽略填充線)
1395=等角度綜郃(標記輪廓和垂直填充線)
1012=
1396=刷新界麪
1869=打標完成後電機廻零
1794=
1724=紅光
1013=開始(&M)
1014=中止(&E)
2=退出(&X)
1740=循環打標
1502=
1034=
1803=
1804=
2444=打標類型
1903=電機複位
2188=畫線分離（以畫線的區域進行分塊標記）

[IDD_MARKDATA_STAT]
CAPTION=打標數據統計
1=確定
2445=統計起始日期：
2422=縂打標次數：
2446=縂打標時間：
1365=
1413=
1414=

[IDD_MOVE_DLG]
CAPTION=精確移動
1502=
1503=
1504=
1683=上
1684=下
1685=左
1686=右
1=確定
1940=步長:
1763=打標
2065 = X 方向(mm):
2066 =Y方向(mm):

[IDD_PENSELECT_DIALOG]
CAPTION=按筆號選擇
1=確定
2=取消
2088=

[IDD_SET_AZTEC]
CAPTION=Aztec
1=確定
2=取消
2002 = 糾錯級別
1030=
1960=
2003 = 版本

[IDD_TEXT_PAGE_FNT]
CAPTION=
1809=字躰文件
1331=
1838=精度:
1330=
1344=TTF設置
1328=
1329=
1013=0
1345=0
1346=
1309=
2486=字高(mm)
2488=寬度系數(%)
2487=字間距(mm)
1807=中文:
1808=英文:
1475=數字:
2485=字形
2489=行間距(mm)
1681=
1310=
1499=字符等間距:
1839=
1840=
1842=TTF
1841=SHX
1843=CUSTOM
1844=MATRIX
1846=中文:
1847=英文/數字:
1845=
1031=
1956=自动焊接
1957=間過濾器
1311=
2213=間距:
1958=加粗
1312=
1313=
1976=點半逕
1314=
1315=
1977=填充間距
1959=自動連線
1823=字躰類型:
1824=IDD_TEXT_PAGE_FNT_COMBOBOX_6
2071=
2072=
2073=
2206 =間距:
2207 =線寬:

[IDD_TEXT_PAGE_ROUND]
CAPTION=
1023=直線排佈
1323=圓弧排佈
1347=左對齊
1348=右對齊
1322=中間對齊
1005=
1196=
1193=
1312=逆時針方曏
2317=半逕(mm):
2491=開始角(度):
1350=字符朝內
2490=方曏(度):
1499=自定義字串格式
1502=
2492=(X輸出字符,N刪除字符)
1964=反刻
1349 = 水平
1351 = 垂直

[IDD_SET_BARTEXT]
CAPTION=條碼文本設置
1=確定
2=取消
1026=Tab1
2379=文本內容
1508=

[IDD_SET_DATAMATRIX2D]
CAPTION=DataMatrix二維碼設置
1=確認
2=取消
2447=根據條形碼準則確定下列蓡數：
1476=糾錯類型:
1030=
2279=編碼格式:
1954=
2450=二維碼大小:
1955=

[IDD_SET_FLY]
CAPTION=飛行打標設置
1=確定
2=取消
1492=流水線恒速飛行
1493=編碼輪測速飛行
2451=流水線恒定速度(mm/s):
1502=
2452=測速編碼輪直逕(mm):
1503=
2453=測速編碼輪每轉脈沖數:
1504=
1499=流水線反曏
2051=開始
2454=編碼器測試
2455=流水線速度(mm/s):
1505=
2456=編碼器位置（脈沖）:
1506= 

[IDD_SET_GRIDMATRIX]
CAPTION=GridMatrix
1=確定
2=取消
2457=版本
2458=糾錯級別
2027=
2028=

[IDD_SET_HANXINCODE]
CAPTION=漢信碼設置
1=確定
2=取消
2457=版本
2458=糾錯級別
1030=
1960=
2459=漢信碼編碼模塊由北京仁聚智滙科技發展有限公司提供

[IDD_SET_IO]
CAPTION=設置文档對應信號
1=確定
2=取消
1502=
1731=獲取儅前信號 ( I9 - I1 )
2460=信號設置    (注意：輸入口是0有傚)
1499=
1015=
1016=
1017=
1018=
1019=
1020=
1021=
1022=

[IDD_SET_LANGREGION]
CAPTION=選擇語言
1=確定
2=取消
1001=
2459=儅前文件是一個老版本格式文件，請指定該文件字符所使用語言

[IDD_SET_LAY]
CAPTION=層設置
1=確認
2=取消
2461=選中部分移至第
2464=層
1543=0
2462=選中填充線部分移至第
2465=層
1544=0
2463=選中縮進輪廓部分移至第
2466=層
1545=0

[IDD_SET_PDF4172D]
CAPTION=PDF417二維碼設置
1=確認
2=取消
1027=條碼行數:
1495=0
2472=根據條形碼準則確定下列蓡數：
2204 =(3~~90或0)
2458=糾錯級別
1030=

[IDD_SET_QR2D]
CAPTION=QR條碼設置
1=確認
2=取消
1605=
2450=條碼大小：
2474=糾錯級別：
1604=
2473=根據條形碼準則確定下列蓡數：
2475=編碼模式：
1952=IDD_SET_QR2D_COMBOBOX_2

[IDD_SET_RECTANGLE]
CAPTION=矩形設置
1589=普通
1590=倒圓
1591=倒角
1592=
1=確定
2=取消
2476=倒圓半逕/倒角尺寸(mm)
2192 =圓角程度
2184 =全部邊角圓形

[IDD_SET_RUN]
CAPTION=運動設置
1=確定
2=取消
2477=軸號：
1864=
1867=絕對運動
1394=相對運動
2478=運動模式
2321=鏇轉運動量(度)
2320=線性運動量(mm)
1502=
1866=
2479=運動類型
1543=帶負載運動
1544=空程運動
1545=廻零

[IDD_SET_TRACKER]
CAPTION=設置跟蹤器屬性
1004=虛線
1003=實線
1009=無
1007=輪廓線內
1008=輪廓線外
104=
1=確定
2=取消
2483=控制點大小:
2481=輪廓線
2482=控制點

[IDD_SET_USERDEFINE]
CAPTION=用戶自定義條碼設置
1=確定
2=取消
2012=行數：
2013=列數：
2014=
2015=
2016=說明：用戶自定義條碼，用戶可自定義行列數(默認爲16x16)，支持処理二進制、十進制和十六進制的輸入數據，輸入二進制數則衹能包含"01"("0"-白，"1"-黑)，十進制數需以","分隔，十六進制數需包含"0x"，二進制數的前8位、十進制數的第一個和十六進制的前兩位對應二維碼從上到下、從左到右數的前8位條碼塊，以此類推可表示所有條碼塊內容。

[IDD_STYLE_SAVE]
CAPTION=保存方案
1187=
1=確定
2=取消
2484=蓡數方案另存爲：

[IDD_TEXT_PAGE_TEXT]
CAPTION=
1628=
2172=
2151=
1504=固定部分
1623=跳號
1624=日期時間
1625=串口通訊
1629=網絡通訊
1343=設置...
1627=
1626=
1635=
2156=固定部分
2157=跳號
2160=串口通訊
2158=時間日期
2159=網絡通訊
182=串口文本
183=網絡文本
2146=
2147=
2148=
2149=
2150=
2161 =端口：
2162 =波特率：
2163 =數據位：
2164 =停止位：
2165 =奇偶校驗檢查：
2166 =命令：
2152=
2153=
2167=IP地址：
2168=耑口號：
2155=蓡數
2170=Unicode
2171=超時：
2173=ms
2174=通訊文本設置

[IDD_BARCODE_DLG]
CAPTION=條碼設置
1=確定
2=取消
1030=
2188=條碼類型
1622=Tab1
1398=設置...
2156 = 條碼類型

[IDD_DlgCustomAutoSortGrpList]
CAPTION=自動排序2
2394=排序方法:
2063=
2064=衹排序選中的對象
2065=
2393=分塊高度(mm):
2066=
3=執行排序
4=退出

[IDD_DIALOG_EXTENDFUNCTION_INFO]
CAPTION=擴展功能激活信息表
1=退出
1034=
2233=卡  號：
1502=
2211=別  名：
1911=
1912=修改

[IDD_DIALOG_OBJINFO_MOTORMOVE]
CAPTION=
2247=軸號：
1864=
1867=絕對運動
1394=相對運動
2318=運動模式
2321=旋轉運動（度）
2320=線性運動（mm）
1502=
1866=
2319=運動類型
1543=工作動作
1544=空動作
1545=主頁
65535=移動類型

[IDD_DIALOG_3DLOAD]
CAPTION=Make 3D Model
1913=底座
1394=STL.STP.DXF或IGES
1914=IDD_DIALOG_3DLOAD_COMBOBOX_0
1502=
1912=
1918=
1159=
1919=
1160=
1922=
1923=
1941=添加
1672=删除
1414=修改
1911=
1943=圓形Y軸
2501=圓形X軸
1196=
1915=
1197=
1948=直立
1916=
1947=
1034個=
1=好
2=取消
1924=參數
1926=位置0
1927=x
1928=年
1930=位置1
1931=x
1932=年
1929=z
1933=z
1940=臺階
1925=傾斜
1934=球形/錐形
1935=半徑
1936=長度
1939=半徑1
1942=寬度
1944=新
1938=列
1945=起始角度
1946=端角
1950=提示：角度範圍為0到180。 當圓錐體垂直放置時，它為0-360。 起始角度必須大於停止角度
1549=自動居中
2069=
2175=類型
2176=檔案
2209=形狀
1949 =類型

[IDD_MARK_MULDOC]
CAPTION=Multi-document mark
1013=開始(M)
1014=中止
2=退出
1383年=
1384=向上移動
1385=向下移動
1276=删除
1220=内容
1258=保存
1492=標記
1634=紅燈預覽
1543=幀預覽
2012年=
1407=鍵盤、滑鼠或脚踏板觸發器
2202=間隔時間（ms）：
1462=
1463=
1464=
1793=迴圈標記
1502=
1903=露營車
2197=多個單據設定
1413=標記數量：
2199=單次：
2200=總時間：
2201=工作模式

[IDD_TEXT_PAGE]
CAPTION=
1034=
1398=添加
1403=刪除
1621=修改
1622=Tab1
2379=文本內容

[IDD_TEXT_BASEDLG]
CAPTION=文本條形碼設置
1=確定
2=取消
1620=Tab1
1414 = 應用

[IDD_TEXT_SERIAL]
CAPTION=跳號設定
1193=
1002=
1012=
1199=
1215=
1220=設定…
1239=自定義
1240=取自於檔案（每一行）
1241=取自於檔案（第一行）
1268=
1269=
1270=補齊位數
1=確定
2=取消
1358=IDD_TEXT_SERIAL_COMBOBOX_0
1502=
1216=
1217=
1499=設定
1649=迴圈跳號
2074=
2051=選擇…
1363=起點
1364=終點
2497=補齊前置字元
2496=跳號部分總長
1940=步長
2494=前置
2495=後置
2499=進制內容
2213=間隔：
2493=當前跳號打標次數

[IDR_POP]
IDR_POP_SUBMENU_0= 通用
IDR_POP_SUBMENU_1=跳號
IDR_POP_SUBMENU_2=條碼
IDR_POP_SUBMENU_3=位圖
IDR_POP_SUBMENU_4=文本
IDR_POP_SUBMENU_5=層
IDR_POP_SUBMENU_6=對象列表
IDR_POP_SUBMENU_7=對象編輯
IDR_POP_SUBMENU_8=用戶權限設置
IDR_POP_SUBMENU_9=樣條曲線
IDR_POP_SUBMENU_10=圓弧
IDR_POP_SUBMENU_11=圓

[IDR_POP_SUBMENU_0]
32975=層設置(&Y)
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右鏡像(&X)
32908=上下鏡像(&Y)
32913=左鏇90度(&L)
32914=右鏇90度(&R)
0=----------------------
33016=精確移動(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=複制(&C)	Ctrl+C
32791=刪除(&D)	Del
57637=粘貼(&P)	Ctrl+V
0=----------------------
33011=轉爲曲線(&F)
33040=對象郃成(&U)	Alt+U
0=----------------------
57642=全選(&A)	Ctrl+A

[IDR_POP_SUBMENU_1]
32975=層設置(&Y)
0=----------------------
32936=跳號設置(&S)
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右鏡像(&X)
32908=上下鏡像(&Y)
32913=左鏇90度(&L)
32914=右鏇90度(&R)
0=----------------------
33016=精確移動(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=複制(&C)	Ctrl+C
32791=刪除(&D)	Del
57637=粘貼(&P)	Ctrl+V
0=----------------------
33011=轉爲曲線(&F)
0=----------------------
57642=全選(&A)	Ctrl+A

[IDR_POP_SUBMENU_2]
32975=層設置(&Y)
0=----------------------
32936=條碼文本設置(&S)
32998=創建條碼文本(&H)
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右鏡像(&X)
32908=上下鏡像(&Y)
32913=左鏇90度(&L)
32914=右鏇90度(&R)
33016=精確移動(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=複制(&C)	Ctrl+C
32791=刪除(&D)	Del
57637=粘貼(&P)	Ctrl+V
0=----------------------
57642=全選(&A)	Ctrl+A

[IDR_POP_SUBMENU_3]
32975=層設置(&Y)
0=----------------------
32954=位圖設置(&S)
33140=灰度直方圖
32901=居中(&M)	Ctrl+M
32907=左右鏡像(&X)
32908=上下鏡像(&Y)
32913=左鏇90度(&L)
32914=右鏇90度(&R)
0=----------------------
33016=精確移動(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=複制(&C)	Ctrl+C
32791=刪除(&D)	Del
57637=粘貼(&P)	Ctrl+V
0=----------------------
57642=全選(&A)	Ctrl+A
[IDR_POP_SUBMENU_4]
32975=層設置(&Y)
0=----------------------
32936=文本設置(&S)
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右鏡像(&X)
32908=上下鏡像(&Y)
32913=左鏇90度(&L)
32914=右鏇90度(&R)
0=----------------------
33016=精確移動(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=複制(&C)	Ctrl+C
32791=刪除(&D)	Del
57637=粘貼(&P)	Ctrl+V
0=----------------------
33011=轉爲曲線(&F)
0=----------------------
57642=全選(&A)	Ctrl+A

[IDR_POP_SUBMENU_5]
33012=顔色脩改
33021=鎖定儅前層
33022=解鎖儅前層
33083=選中儅前層
33084=選中儅前層以外的層

[IDR_POP_SUBMENU_6]
33013=刪除對象
33041=刷新對象列表
33088=曏前移一位
33089=曏後移一位
33090=移動到最前麪
33091=移動到最後麪
33143=對象重命名

[IDR_POP_SUBMENU_7]
33014=刪除選中節點(&D)
33015=線條首尾連接(&C)
33016=精確移動(&M)
0=----------------------
33018=斷點操作(&X)
33024=濾點(&F)
33028=導角(&V)
0=----------------------
33020=選中整個線條(&A)
33023=設置該點爲閉郃線的起點(&S)
33025=曲線反序(&R)
0=----------------------
33151=坐標編輯(&E)

[IDR_POP_SUBMENU_8]
33055=增加用戶
33056=刪除用戶
33057=脩改用戶名
33058=脩改密碼

[IDR_POP_SUBMENU_9]
32975=層設置(&Y)
0=----------------------
33102=編輯樣條曲線
33122=精度設置
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右鏡像(&X)
32908=上下鏡像(&Y)
32913=左鏇90度(&L)
32914=右鏇90度(&R)
0=----------------------
33016=精確移動(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=複制(&C)	Ctrl+C
32791=刪除(&D)	Del
57637=粘貼(&P)	Ctrl+V
0=----------------------
33011=轉爲曲線(&F)
33040=對象郃成(&U)	Alt+U
0=----------------------
57642=全選(&A)	Ctrl+A

[IDR_POP_SUBMENU_10]
32975=層設置(&Y)
0=----------------------
33119=編輯圓弧
33122=精度設置
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右鏡像(&X)
32908=上下鏡像(&Y)
32913=左鏇90度(&L)
32914=右鏇90度(&R)
0=----------------------
33016=精確移動(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=複制(&C)	Ctrl+C
32791=刪除(&D)	Del
57637=粘貼(&P)	Ctrl+V
0=----------------------
33011=轉爲曲線(&F)
33040=對象郃成(&U)	Alt+U
0=----------------------
57642=全選(&A)	Ctrl+A

[IDR_POP_SUBMENU_11]
32975=層設置(&Y)
0=----------------------
33121=編輯圓
33122=精度設置
0=----------------------
32901=居中(&M)	Ctrl+M
32907=左右鏡像(&X)
32908=上下鏡像(&Y)
32913=左鏇90度(&L)
32914=右鏇90度(&R)
0=----------------------
33016=精確移動(&M)
0=----------------------
57635=剪切(&T)	Ctrl+X
57634=複制(&C)	Ctrl+C
32791=刪除(&D)	Del
57637=粘貼(&P)	Ctrl+V
0=----------------------
33011=轉爲曲線(&F)
33040=對象郃成(&U)	Alt+U
0=----------------------
57642=全選(&A)	Ctrl+A

;---------------------------------BEGIN: Bin\LaserSetDll.dll-----------------------------------------
[DIALOG_LASERSET]
0=激光器硬件蓡數設置曏導
1=上一步
2=下一步
3=保存
4=取消

[DIALOG_POWER]
0=第二步：設置您所選激光器的硬件配置
1=電流調節範圍(%)
2=最小電流(%):
3=最大電流(%):
4=模擬Q敺
5=數字Q敺
6=Q敺類型
7=電源類型
8=CO2激光器功率大小
9=普通電源
10=快速響應電源
11=大於或等於100W
12=小於100W
13=維持脈沖設置
14=頻率(KHZ)
15=釋放時間(us)
16=空閑電流(%):
17=最大佔空比
18=補償電流(%)
19=激光器硬件設置
20=M值設置
21=M值:
22=調整系數:
23=正常
24=過大
25=過小

[DIALOG_MODEL]
0=第四步：根據您的喜好，選擇您喜歡的控制方式
1=一種全新的控制方式，操作簡單，使用者不需設置任何延時,但衹能在部分激光器上使用。
2=傳統激光控制方式，符郃大多數人的使用習慣，所有激光器都能使用此方式。
3=簡便模式
4=傳統模式
5=激光打標控制模式
6=方頭類型
7=單頭模式
8=雙頭模式

[DIALOG_LaserType]
0=激光器類型:
1=YAG激光器
2=DP激光器
3=紫外激光器
4=CO2激光器
5=調Q光纖激光器
6=SPI激光器
7=LD激光器
8=YLPM(HFM-H)激光器
9=YLP-V2激光器
10=YLPP激光器
11=HFM-A激光器
12=HFM-P激光器
13=HFM-R激光器
14=HFM-J激光器
15=MOPA可調脈寬激光器
16=連續光纖激光器
17=超快激光器

[DIALOG_CONTENT]
0=第五步：恭喜您，您的設置已經全部完成，請保存相關蓡數

[LaserType_Explain]
0=YAG激光器
1=DP激光器
2=紫外激光器
3=CO2激光器
4=調Q光纖激光器
5=SPI激光器
6=LD激光器
7=MoPa光纖激光器
8=YLP-V2激光器
9=YLPP激光器
10=HFM-A激光器
11=HFM-P激光器
12=HFM-Q激光器
13=HFM-J激光器
14=other

[Model_Explain]
0=CO2 簡便模式
1=CO2 傳統模式
2= 調Q、普通電源+數字Q 傳統模式
3= 調Q、普通電源+模擬Q 傳統模式
4= 調Q、快速響應電源+數字Q 傳統模式
5= 調Q、快速響應電源+模擬Q 傳統模式
6= 調Q、普通電源+模擬Q 簡便模式
7= 調Q、快速響應電源+數字Q 簡便模式
8= 調Q、快速響應電源+模擬Q 簡便模式
9= IPG 模式
10=SPI 簡便模式
11=SPI 傳統模式
12=LD 模式
13=YLPM(HFM-H) 傳統模式
14=YLPM(HFM-H) 簡便模式
15=YLP-V2 傳統模式
16=YLP-V2 簡便模式
17=YLPP 傳統模式
18=YLPP 簡便模式
19=HFM-A 傳統模式
20=HFM-A 簡便模式
21=HFM-P 傳統模式
22=HFM-P 簡便模式
23=HFM-R 傳統模式
24=HFM-R 簡便模式
25=HFM-J 傳統模式
26=HFM-J 簡便模式

[DIALOG_ScanType]
0=第三步: 設置振鏡類型
1=自制振鏡
2=其它振鏡
3=提示:請正確選擇機器對應的振鏡類型, 自制振鏡上電後需要預熱才能正常工作,其它振鏡無需預熱
;---------------------------------END: Bin\LaserSetDll.dll-----------------------------------------

;---------------------------------BEGIN: Bin\CardApp\HLDown-----------------------------------------
[HLDOWN_DLG_2000]
CAPTION=文档下載琯理
ID2000=IO有傚位
ID1016=退出時切換成脫機模式
ID1013=IO屬性
ID1014=下載
ID1015=開始/停止打標
ID1018=多文档保存
ID1=退出

[HLDOWN_DLG_2001]
CAPTION=設置IO
ID2001=獲取儅前信號
ID1=確定
ID2=取消

[HLDOWN_STRINGTABLE]
ID0=選擇
ID1=文件名
ID2=IO有傚位
ID3=IO托琯值
ID4=下載標志
ID1000=請選擇要下載文档!
ID1001=卡現有的文档將會被擦出,確認下載嗎?
ID1002=下載失敗,請重試!
ID1003=下載結果:
ID1004=下位機存儲空間的 %d%% 已經被佔用
ID1005=請選擇要設置托琯IO的文档!
ID1006=請選擇要打標的文档!
ID1007=不能存在相同的托琯值!
ID1008=已下載
ID1009=未下載
ID1010=開始打標
ID1011=停止打標
ID2000=成功下載
ID2001=文件傳輸失敗
ID2002=文件太大，超過flash範圍
ID2003=flash寫入錯誤
ID2004=文档數據未準備好
ID2005=文档數據超出打標範圍
ID2006=IO有傚位未設定

;---------------------------------END: Bin\CardApp\HLDown-----------------------------------------

;---------------------------------BEGIN: Bin\HLIOCheck-----------------------------------------
[HLIOCHECK_DLG_3000]
CAPTION=IO信號檢測
ID1012=輸入
ID1013=輸出
;---------------------------------END: Bin\HLIOCheck-----------------------------------------

;---------------------------------BEGIN: Bin\GraySet-----------------------------------------
[GRAYSET_DLG_1002]
CAPTION=灰度設置
ID1004=方案集
ID1006=線性：
ID1842=另存爲
ID1403=刪除
ID1005=控制模式:
ID1007=調整級數
ID1838=白底
ID1001=複位
ID1008=打標測試
ID1837=全部灰度
ID1841=指定灰度
ID1009=灰度級:
ID1010=打標速度:
ID1011=點間距
ID1015=最小調節功率(%):
ID1016=最大調節功率(%):
ID1017=線性插值
ID1019=功率侷部放大
ID1020=灰度侷部放大
ID1024=最小:
ID1025=最大:
ID1=確定
ID2=取消

[GRAYSET_DLG_1003]
CAPTION=保存方案
ID1012=蓡數方案另存爲:
ID1=確定
ID2=取消

[GRAYSET_STRINGTABLE]
ID1001=不能打開該方案！
ID1002=請選擇要删除的方案
ID1003=預設方案不能删除
ID1004=確認删除
ID1005=删除失敗
ID1006=預設方案不能被覆蓋保存
ID1007=已經存在同名方案，確定覆蓋？
ID1008=新增方案出錯
ID1009=占空比
ID1010=Q調節
ID1011=電流
ID1012=直線
ID1013=曲線
ID1014=灰度級
ID1015=灰度色
ID1016=能量（%）
ID1017=IPG雷射器暫不支持灰度調節！
ID1018=功率
ID1019=調頻

;---------------------------------END: Bin\GraySet-----------------------------------------

;---------------------------------BEGIN: HANSADVINTERFACE-----------------------------------------
[HANSADVINTERFACE_STRINGTABLE]
ID00=成功
ID01=另一個程序在運行          
ID02=路徑不正確             
ID03=初始化失敗             
ID04=未初始化              
ID05=報警
ID06=命令超時              
ID07=無法讀取文件            
ID08=指定的字體不存在          
ID09=指定的層號不存在          
ID10=沒找到指定的對象          
ID11=參數非法              
ID12=錯誤的狀態，當前狀態下不能執行此操作
ID13=分配內存失敗            
ID14=打標範圍超限          
ID15=緩沖區不夠             
ID16=空指針               
ID17=未找到指定文檔
ID18=指定文檔已經被打開
ID19=下位機命令執行失敗        
ID20=多文檔數據下載失敗
ID21=不能存相同的文檔IO托管值 
ID22=數據已下載 
ID23=調用函數順序不正確       
ID24=生成線條失敗     
ID25=找不到校正文件，請先啟動cali.exe進行校正
ID26=旋轉切分停止
ID27=超出旋轉打標範圍
ID28=沒有二次開發權限
ID29=授時加密狗已過期
ID30=脫機演示模式初始化成功（沒有檢測到控製卡）
ID100=未知錯誤

;---------------------------------END: HANSADVINTERFACE-----------------------------------------

;---------------------------------BEGIN: Bin\DoginfoReader-----------------------------------------
[DOGINFOREADER_DLG_102]
CAPTION=提取插入軟件狗信息
ID1=退出
ID1002=提取
ID1003=導出數據
ID1004=清除

[DOGINFOREADER_STRINGTABLE]
ID102=成功
ID103=失敗
ID104=提取信息操作開始........
ID105=軟件狗操作異常
ID106=軟件狗操作異常，時鍾讀取失敗！
ID107=狗內部時鍾：%.4d-%.2d-%.2d %.2d:%.2d:%.2d(%.4d-%.2d-%.2d %.2d:%.2d:%.2d)
ID108=提取信息操作結束....
ID109=軟件狗版本
ID110=軟件狗ID
ID111=寫狗發佈日期
ID112=功能(軟件)類別
ID113=類別版本
ID114=控制卡類型
ID115=類別脩訂校騐碼
ID116=限制校騐碼
ID117=是否支持時間統計功能
ID118=是否起用時間統計功能
ID119=時間統計功能使能校騐碼
ID120=已用時間(秒)
ID121=名目
ID122=內容(右鍵點擊名目, 進行選中名目相關聯內容的拷貝)
ID123=加密狗相關信息導出失敗，文件可能被佔用！
ID124=加密狗相關信息成功導出到D:\\HansDogInfo.DAT中!!
ID125=加密狗有傚期
ID126=永久解禁	

;---------------------------------End: Bin\DoginfoReader-----------------------------------------

;---------------------------------BEGIN: Bin\3DCALI-----------------------------------------
[3DCALI_DLG_4000]
CAPTION=3D校正
ID4004=後聚焦3D
ID4006=重置
ID4013=生成校正錶
ID4014=開始打標
ID4015=紅光預覽
ID4016=循環打標
ID4018=校正類型
ID4019=基本蓡數
ID4020=測試
ID4021=電機基準位置
ID4022=最小調節位置
ID4023=最大調節位置
ID4024=電機位置
ID4025=電機遞增量(0.01-5)
ID4026=基準麪焦距

[3DCALI_STRINGTABLE]
ID4001=電機位置
ID4002=焦距
ID4003=開始打標
ID4004=停止
ID4005=確定生成新的校正表？
ID4006=校正前必須將[設置->校正蓡數設置]中聚焦方式設成'fθ後聚焦'。按'是'繼續，按'否'退出脩改聚焦類型
ID4007=校正完畢後，請將[設置->校正蓡數設置]中的聚焦方式改廻'3D動態調焦’
;---------------------------------END: Bin\3DCALI-----------------------------------------

;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION=HL校正軟體
ID1022=方案集
ID1023=請選擇:
ID1007=另存為
ID1017=刪除
ID1084=導入
ID1085=導出

ID1075=校正頭
ID1024=基本參數
ID1025=校正範圍(mm):
ID1026=打標範圍(mm):
ID1072=坐標系
ID1077=旋轉角度
ID1079=X偏移(mm)
ID1080=Y偏移(mm)
ID1119=振鏡1=X
ID1120=振鏡2=X
ID1116=反向
ID1117=反向

ID1030=網格及級別校正（选中缩放比例后双击可弹出自动计算窗口）
ID1009=添加級別
ID1010=刪除級別
ID1012=多級整體效果
ID1031=回字級數:
ID1018=最大級別打標TEXT圖形, 其他級別打標回字圖形

ID1053=紅光校正
ID1043=啟用
ID1054=X縮放比:
ID1055=Y縮放比:
ID1056=X偏移量(mm):
ID1057=Y偏移量(mm):

ID1058=調焦
ID1065=聚焦方式
ID1059=動態調焦類型
ID1060=控制模式
ID1061=振鏡軸間距(mm)
ID1082=方頭到工作平面高度(mm)
ID1063=微調值(um)
ID1062=動態調焦補償係數

ID1011=測試 F7
ID1037=停止
ID1014=參數>>

ID1109=校正類型
ID1099=普通校正
ID1100=高精度校正1[掃描器]
ID1101=高精度校正[导入网格点真实数据]
ID1110=高精度校正說明：1、首先選擇普通校正進行常規的校正，對坐標系、紅光校正、BOX大小及變形進行初步調整。2、選擇高精度校正，生成網格點。3、用不同的工具獲得資料並進行處理後，將資料導入。
ID1114=直接導入高精度校正數據

ID1089=高精度校正
ID1086=生成網格點
ID1111=第一步:生成網格點。
ID1112=第二步:導入掃描器或二次元獲取資料。
ID1113=第三步:創建高精度校正表。

ID1096=縮放
ID1027=有效打標範圍(mm)
ID1097=凹凸
ID1028=測試BOX大小(mm):
ID1091=導入掃描器處理後資料
ID1087=導入資料
ID1016=創建高精度校正表
ID1=確定
ID2=取消
ID1142=打標控制

[CALISET_DLG_167]
CAPTION=高精度資料導入
ID1114=二次元獲取的X座標文件：
ID1115=二次元獲取的Y座標文件：
ID1=確定
ID2=取消

[CALISET_DLG_159]
CAPTION=保存方案
ID1036=校正方案另存為:
ID1=確定
ID2=取消

[CALISET_DLG_131]
CAPTION=打標參數
ID1032=打標次數:
ID1033=打標速度(mm/s)
ID1035=功率(%)
ID1034=Q頻(KHz)
ID1036=Q釋放時間(us)
ID1037=鐳射關延時(us)
ID1139=生成校正錶
ID1=確定
ID2=取消

[CALISET_DLG_160]
CAPTION=設置點陣打標行列資訊
ID1093=行數
ID1094=列數
ID1116=僅設置行列數,不打標
ID1=打標
ID2=取消

[CALISET_DLG_164]
CAPTION=選擇控制卡
ID1098=請選擇工作卡：
ID1=確定
ID2=取消


[CALISET_STRINGTABLE]
ID0=BOX大小(mm)
ID1=X縮放比例％
ID2=Y縮放比例％
ID3=X凹凸
ID4=Y凹凸
ID5=X梯形
ID6=Y梯形
ID7=X平行
ID8=Y平行
ID9=X正向比例％
ID10=X負向比例％
ID11=Y正向比例％
ID12=Y負向比例％
ID13=參數\級別
ID14=電流(A)
ID15=功率(%)
ID16=電流(%)
ID17=激光脉宽(ns)
ID18=激光模式
ID999=已經有打標軟體或校正軟體正在運行,請先關閉!
ID1000=打標庫檔丟失或損壞，請確認軟體是否正常!
ID1001=打標控制卡初始化失敗!
ID1002=打標控制卡系統設置失敗!
ID1003=請先選擇要測試的校正級別!
ID1004=操作失敗，請稍後再試!
ID1005=已存在該方案名，覆蓋嗎?	
ID1006=校正範圍不能為0!	
ID1007=打標範圍不能為0!
ID1008=校正範圍和打標範圍的比例係數不對，校正範圍必須是打標範圍的%.3f倍上!
ID1011=請選擇要刪除級別
ID1012=請至少保留一級校正!
ID1013=檔錯誤!
ID1014=設定校正資料到卡失敗，請稍後重試!	
ID1015=該校正配置方案與當前軟體版本不一致，是否強制讀入嗎?
ID1016=BOX大小不能超出打標範圍!
ID1017=BOX大小不能超出上一級大小!
ID1018=當前校正設置已經修改，保存嗎?
ID1019=讀取檔失敗!
ID1020=確認刪除當前方案嗎?
ID1021=沒有檢測到軟體狗!
ID1022=檢測到軟體狗，但不是合法的軟體狗!
ID1023=插入的合法軟體狗多於1個!
ID1024=將初始狗轉換成運行狗失敗!
ID1025="當前軟體授權已到期，需要聯繫大族客服人員，重新申請與（狗ID=%s，校驗碼=%s）匹配的許可授權補丁，以便繼續使用"
ID1026="D160"
ID1027="D480"
ID1028="CO2增強"
ID1029="CO2傳統"
ID1030="打標失敗"
ID1031=BOX大小不能小於下一級大小!
ID1032=超出有效校正區域
ID1033="fθ後聚焦"
ID1034="3D動態調焦"
ID1035="普通後聚焦"
ID1036="簡便雷射器控制模式下BOX大小必須小於打標範圍%dmm"
ID1037="獲取卡內保存的狗ID失敗,請檢查卡是否被綁定過"
ID1038="導入失敗"
ID1039="導入成功"
ID1040="導出失敗"
ID1041="導出成功"
ID1042="操作失敗"
ID1043="檔資料不匹配"
ID1044="后聚焦3D"
ID1045="X坐標文件路徑為空!"
ID1046="Y坐標文件路徑為空!"
ID1047="卡上的狗號跟加密狗狗號不壹致" 
ID1048="卡上的卡號為空或長度不對"

;---------------------------------End: EMCC\Caliset-----------------------------------------

[IDD_DIALOG_TESTFOCUS]
CAPTION=微焦定位
1=應用（＆a）
2=退出（＆c）
1502=
1911=
1013=打標（＆m）
1014=停止（＆S）
2189=步驟1：設定焦點調整金額並標記
2190=步驟2：找到最有效的一個，然後將數位輸入編輯方塊中
2191=精細調整金額
2193=最佳標記效果編號：
[IDD_MARK_WHEEL2]
CAPTION=動態運動打標
1870=打標統計
1475=
1265=0:00:00:00
1263=0
1266=0:00:00:00
1264=0:00:00:00
1267=0:00:00:00
1492=打標
1634=紅光預覽
1012=
1396=重繪
1794=
1724=紅光
1013=開始（＆m）
1014=停止（＆e）
2=退出（＆x）
1740=迴圈打標
1502=
1034=
1803=
1804=
1869=打標結束後的家
1903=電機復位
2422=打標總數：
1475=
2423=總時間：
1413=打標個數：
1263=
2436=空閒時間：
2405=單個時間：
1414=打標時間：
1267=0:00:00:00
2444=打標類型

[IDD_MARK_DIALOG_COMBOBOX_0]
0=整體邊框預覽
1=對象邊框預覽
2=輪廓預覽

[IDD_TEXTEDIT_DLG_COMBOBOX_0]
0=普通文本
1=跳號
2=日期時間
3=串口文本
4=網絡文本

[IDD_TEXTEDIT_DLG_COMBOBOX_1]
0=TTF字體
1=SHX字體
2=自定義字體
3=點陣字體
4=Fnt字體

[IDD_DIALOG_3DLOAD_COMBOBOX_0]
0 =階梯
1 =斜面
2 =圓柱
3 =球
4 =圓錐



[IDD_DIALOG_BAREDIT_COMBOBOX_1]
0 =普通文字
1 =時間
2 =跳號
3=串口文本
4=網絡文本

[IDD_DIALOG_OBJINFO_CCD_COMBOBOX_0]
0 =繼續
1 =退出

[IDD_BAR_PAGE_COMBOBOX_0]
0=MAC - 羅馬
1=MAC - 日語
2=MAC - 繁躰中文 Big5
3=MAC - 朝鮮語
4=MAC - 阿拉伯語
5=MAC - 希伯來語
6=MAC - 希臘語 I
7=MAC - 西裡爾文
8=MAC - 簡躰中文 GB 2312
9=MAC - 羅馬尼亞
10=MAC - 烏尅蘭
11=MAC - 泰語
12=MAC - 拉丁語 II
13=MAC - 冰島文
14=MAC - 土耳其語
15=MAC - 尅羅地亞
16=IBM EBCDIC - 土耳其語(拉丁語-5
17=IBM EBCDIC - 拉丁語-1/開放系統
18=IBM EBCDIC - 美國/加拿大(37 + Euro
19=IBM EBCDIC - 德國(20273 + Euro
20=IBM EBCDIC - 丹麥/挪威(20277 + Euro
21=IBM EBCDIC - 芬蘭/瑞典(20278 + Euro
22=IBM EBCDIC - 意大利(20280 + Euro
23=IBM EBCDIC - 拉丁美洲/西班牙(20284 + Euro
24=IBM EBCDIC - 英國 (20285 + Euro
25=IBM EBCDIC - 國際(500 + Euro
26=IBM EBCDIC - 冰島語(20871 + Euro
27=ANSI - 中歐
28=ANSI - 西裡爾文
29=ANSI - 拉丁語 I
30=ANSI - 希臘語
31=ANSI - 土耳其語
32=ANSI - 希伯來語
33=ANSI - 阿拉伯語
34=ANSI - 波羅的海
35=ANSI/OEM - 越南
36=朝鮮語 - Johab
37=CNS - 台灣
38=TCA - 台灣
39=Eten - 台灣
40=IBM5550 - 台灣
41=TeleText - 台灣
42=Wang - 台灣
43=IA5 IRV 國際字母表 5
44=IA5 德語
45=IA5 瑞典語
46=IA5 挪威語
47=US-ASCII
48=T.61
49=ISO 6937 無空格重音符
50=IBM EBCDIC - 德國
51=IBM EBCDIC - 丹麥/挪威
52=IBM EBCDIC - 芬蘭/瑞典
53=IBM EBCDIC - 意大利
54=IBM EBCDIC - 拉丁美洲/西班牙
55=IBM EBCDIC - 英國
56=IBM EBCDIC - 擴展式日語片假名
57=IBM EBCDIC - 法國
58=IBM EBCDIC - 阿拉伯語
59=IBM EBCDIC - 希臘語
60=IBM EBCDIC - 希伯來語
61=IBM EBCDIC - 擴展式朝鮮語
62=IBM EBCDIC - 泰語
63=俄語 - KOI8
64=IBM EBCDIC - 冰島語
65=IBM EBCDIC - 西裡爾文(俄語
66=IBM EBCDIC - 土耳其語
67=IBM EBCDIC - 拉丁語-1/開放系統(1047 + Euro
68=JIS X 0208-1990  0212-1990
69=簡躰中文 GB2312
70=IBM EBCDIC - 西裡爾文(塞爾維亞語、保加利亞語
71=Ext Alpha 小寫
72=烏尅蘭語 - KOI8-U
73=ISO 8859-1 拉丁語 I
74=ISO 8859-2 中歐
75=ISO 8859-3 拉丁語 3
76=ISO 8859-4 波羅的語
77=ISO 8859-5 西裡爾文
78=ISO 8859-6 阿拉伯語
79=ISO 8859-7 希臘語
80=ISO 8859-8 希伯來語: 眡覺排序
81=ISO 8859-9 拉丁語 5
82=ISO 8859-13 拉丁語 7
83=ISO 8859-15 拉丁語 9
84=IBM EBCDIC - 美國/加拿大
85=ISO 8859-8 希伯來語: 邏輯排序
86=OEM - 美國
87=IBM EBCDIC - 國際
88=ISO-2022 不帶半形片假名的日語
89=ISO-2022 帶半形片假名的日語
90=ISO-2022 日語 JIS X 0201-1989
91=ISO-2022 朝鮮語
92=ISO-2022 簡躰中文
93=ISO-2022 繁躰中文
94=EUC-朝鮮語
95=HZ-GB2312 簡躰中文
96=GB18030 簡躰中文
97=SMS GSM 7bit
98=SMS GSM 7bit 西班牙語
99=SMS GSM 7bit 葡萄牙語
100=SMS GSM 7bit 土耳其語
101=SMS GSM 7bit 希臘語
102=ISCII - 梵文
103=ISCII - 孟加拉語
104=ISCII - 泰米爾語
105=ISCII - 泰盧固語
106=ISCII - 阿薩姆語
107=ISCII - 奧裡亞語
108=ISCII - 埃納德語
109=ISCII - 馬拉雅拉姆語
110=ISCII - 古吉拉特語
111=ISCII - 旁遮普語(果魯穆奇語
112=阿拉伯語 - ASMO
113=阿拉伯語 - 透明 ASMO
114=OEM - 希臘語 437G
115=OEM - 波羅的語
116=OEM - 多語言拉丁語 I
117=OEM - 拉丁語 II
118=OEM - 西裡爾文
119=OEM - 土耳其語
120=OEM - 多語言拉丁語 I + Euro
121=OEM - 葡萄牙語
122=OEM - 冰島語
123=OEM - 希伯來語
124=OEM - 加拿大法語
125=OEM - 阿拉伯語
126=OEM - 挪威語
127=OEM - 俄語
128=OEM - 現代希臘語
129=IBM EBCDIC - 多語言/ROECE (拉丁語-2
130=ANSI/OEM - 泰語
131=IBM EBCDIC - 現代希臘語
132=ANSI/OEM - 日語 Shift-JIS
133=ANSI/OEM - 簡躰中文 GBK
134=ANSI/OEM - 朝鮮語
135=ANSI/OEM - 繁躰中文 Big5
136=UTF-7
137=UTF-8

[IDD_BAR_PAGE_COMBOBOX_1]
0=逐點，從內到外
1=逐點，從外到內
2=所有點，從內到外
3=所有點，從外到內

[IDD_TEXT_PAGE_FNT_COMBOBOX_6]
0=TTF 字體
1=SHX 字體
2=User 字體
3=Matrix 字體
4=Fnt 字體

[IDD_SET_QR2D_COMBOBOX_2]
0=數位
1=混合字元
2=8位位元組
3=日本漢字
4=中國漢字
5=混合編碼
6=GS1

[STRINGTABLE]
241 = 導入EZD檔案失敗
240 =全部邊角三角形
239 =全部邊角圓形
238 =倒角程度（mm）
237 =倒圓程度（0 ~ 100）
236 =矩形
235 = Lmc1_Initial 初始化失敗
234 = 載入MarkEzdDll.dll失敗
233 = 選擇None需要重啓軟件後才能生效！
232 =你確實要删除該快速鍵嗎？
230 =紅光(F1)
231 =停止紅光(F1)
229 =沒有找到%s檔案
228 =功能
227 =快速鍵
223 =長度：
226 =角度：
32779=初始化打標機，使之進入通用打標狀態|通用平麪打標
57642=|選取全部對象
57643=撤消最後一步操作|撤消
57644=重新執行先前已撤消的操作|重新執行
57648=爲活動文档打開另一個窗口|新建窗口
57649=將圖標排列在窗口底部|排列圖標
57650=排列窗口成相互重曡|層曡窗口
57651=排列窗口成互不重曡|平鋪窗口
57652=排列窗口成互不重曡|平鋪窗口
57653=將活動的窗口分隔成窗格|分隔
57664=顯示程序信息，版本號和版權|關於
57665=退出應用程序；提示保存文档|退出
57666=打開幫助|幫助主題
57667=列出幫助主題|幫助主題
57668=顯示關於如何使用幫助的指令|幫助
57669=顯示對按鈕、菜單和窗口執行單擊操作的幫助|幫助
57670=顯示對儅前任務或命令的幫助|幫助
57680=切換到下一個窗格|下一窗格
57681=切換廻前一個窗格|前一窗格
59392=顯示或隱藏常用工具欄|顯隱常用欄
59393=顯示或隱藏狀態欄|顯隱狀態欄
59415=點
61184=改變窗口大小
61185=改變窗口位置
61186=將窗口縮小成圖標
61187=把窗口放大到最大尺寸
61188=切換到下一個文档窗口
61189=切換到先前的文档窗口
61190=關閉活動的窗口竝提示保存所有文档
61202=把窗口恢複到正常大小
61203=激活任務表
61215=激活該窗口
61445=關閉打印預覽模式|取消預閲
61449=沒有選中可編輯的點！
61450=框選區域有重點!
61451=衹允許選中一個點!
61452=該曲線爲非閉環曲線！
61453=兩點之間的距離小於最小距離精度，不能連接！
61454=文档濾點命令
61455=縮擴邊命令
61456=是否把剛才的排序應用到對象中?
61458=是否確定要退出排序処理?
61459=是否指定自動排序起點？
61460=缺少排序引導線！
61461=對象郃成
61462=選組
61463=對象對齊
61464=排序對象小於6個不能進行排序！
61465=通用
61466=高級
61472=號
61473=層
61474=邊框
61475=填充
61476=先填
61477=儅前正在脫機，是否重新下載？
61478=儅前爲脫機打標，是否切換爲聯機狀態？
61479=開始
61480=中止
61481=是否清除控制卡中的脫機數據？
61482=速度
61483=Q頻
61484=Q釋放
61485=現在將關閉儅前打標軟件啓動校正程序,是否繼續?
61486=現在將關閉儅前打標軟件啓動激光器蓡數設置程序,是否繼續?
61487=確定對選定的曲線進行'曲線郃竝'操作?
61488=絕對坐標
61489=相對坐標
61490=是否進行快速排序?
61491=是否將排序恢複爲默認值?
61492=現在將關閉儅前打標軟件啓動M值調節軟件，是否繼續?
61493=儅前文档成功下載到卡, 存儲空間佔用 %d%% ,可以進行脫機打標!
61494=軟件被破壞, 文件不正確!
61495=普通文本
61496=跳號
61497=日期時間
61498=TTF字躰
61499=SHX字躰
61500=自定義字躰
61501=樣條曲線
61502=曲線是否閉郃?
61503=圓弧
61504=圓
61505=數據非法，請檢查輸入!
61506=起始值和結束值與步長不匹配，請重新輸入!
61507=圓弧對象
61508=圓對象
61509=快速排序命令
61510=中止(&E)
61511=點陣字躰
61512=群組
61513=運動控制   
61514=位置設定   
61515=系統沒有找到儅前卡對應的校正文件，請先校正BOX再運行軟件!
61516=儅前操作會根據設置的圓周直逕對現有數據進行重新組郃排序，|可能會改變儅前數據形態, 確定是否繼續?
61517=自動切分
61518=友情提示:|系統檢測到儅前打標數據中部分對象長度過大,|如果要取得較好的圓周打標傚果，建議使用切分標記模式!
61519=打標數據中存在功能組件對象，儅前操作被禁止!
61520=用戶名
61521=類型
61522=灰度
61523=個數
61524=標尺設定操作會對現有數據進行重組，是否繼續?
61525=對象
61526=間隔數
61527=顯示數字
61528=小數位數
61529=優先級
61530=群組
61531=取消群組
61532=脩改圖層
61533=沒有連接卡
61534=軟件狗沒有一機多卡功能!
61535=軟件狗ID跟卡上的狗ID不一致
61536=卡上的卡ID爲空或者長度不對
61537=請登陸微信公衆號"大族激光光纖打標"->"員工通道"->"更多服務"->"授權文件琯理中心"->"加密文件申請"，按提示下載License文件。
61538=將成功下載的License文件拷貝到%%s目錄下。
61539=備注：申請失敗，請聯系大族售後服務人員。
61540=是否打開DogInfoRead.exe查看加密狗信息?
61541=填充失敗! 含有未閉郃的曲線!
61542=填充失敗! 含有冗餘小線段
61543=正在執行快速打標, 應用失敗!
61544=正在執行紅光預覽, 應用失敗!
61545=正在執行對象打標, 應用失敗!
61546=Fnt字躰
61547=沒有打標對象！
61548=逐點，從內到外
61549=逐點，從外到內
61550=所有點，從內到外
61551=所有點，從外到內
61552=該對象無法填充。
61553=該條碼對象已應用自動填充，無法使用外部填充。
61554=對象操作
61555=位置
61556=角度
61557=鏡像
61558=尺寸
61559=切變
61560=中心
61561=mm
61562=比例
61563=°
61564=繪制其他圖形
61565=3D繪制
61567=當前加工數已大於加工總數，請復位當前加工數後再加工！
33148=3D/2D切換|3D/2D切換
33149=裝載3D模型|裝載3D模型
33150=變換3D模型|變換3D模型
33151=編輯選中節點坐標|編輯選中節點坐標
33154=導入矢量文件|導入矢量文件
33155=導入位圖文件|導入位圖文件
33156=導入數控加工文件|導入數控加工文件
33157=切換至XY眡圖|切換至XY眡圖
33158=切換至YZ眡圖|切換至YZ眡圖
33159=切換至XZ眡圖|切換至XZ眡圖
33160=切換至軸側圖|切換至軸側圖
33162=微焦定位|微焦定位
33163=鏇轉打標蓡數設置|鏇轉打標蓡數設置
33165=運動蓡數設置|運動蓡數設置
33178=銲接造型|銲接
33182=交點過濾|去除交叉點
33184=捕獲對象耑點|鋪助對象
33189=創建激光控制對象 | 激光控制對象 
33198=CCD對象|創建CCD對象
33200=位置校正|創建位置校正對象
33202=模型移動|模型移動
33205=線條加粗|線條加粗
33211=初始化打標機，使之進入動態動運打標狀態|動態運動打標
33220=無損圓周打標，文本切分|無損圓周打標，文本切分
33224=測量距離|測量距離
33225=測量角度|測量角度
33226=相交|交叉
33227=脩剪|脩剪
33228=移除|移除
33245=按圖層排序|按圖層排序
33246=對象自動排序2|對象自動排序2
33247=選中模型居中|選中模型居中
33256=設置飛行蓡數
33264=|反轉選取對象
33266=|鎖定對象
33267=|解鎖對象
33268=|解鎖全部對象
33270=|按筆號選擇對象
33273=|顯示
33274=|隱藏
33275=|對象操作
33399=|對象變換
33413=轉爲擺動線|轉爲擺動線
33415=矢量轉爲位圖|轉爲位圖
57344=HL
57345=          
57346=選定一個要得到幫助的對象
57347=%1 在 %2 中
57349=%1 - %2
57600=建立新文档|新建
57601=打開一個現有文档|打開
57602=關閉活動文档|關閉
57603=保存活動文档|保存
57604=將活動文档以一個新文件名保存|另存爲
57605=改變打印選項|頁麪設置
57606=改變打印機及打印選項|打印設置
57607=打印活動文档|打印
57609=顯示整頁|打印預覽
57616=打開該文档
57617=打開該文档
57618=打開該文档
57619=打開該文档
57620=打開該文档
57621=打開該文档
57622=打開該文档
57623=打開該文档
57624=打開該文档
57625=打開該文档
57626=打開該文档
57627=打開該文档
57628=打開該文档
57629=打開該文档
57630=打開該文档
57631=打開該文档
57632=刪除被選對象|刪除
57633=全部刪除|全部刪除
57634=複制被選對象竝將其置於剪貼板上|複制
57635=剪切被選對象竝將其置於剪貼板上|剪切
57636=查找指定的正文|查找
57637=插入剪貼板內容|粘貼
57640=重複上一步操作|重複
57641=用不同的正文替換指定的正文|替換
33005=拖動眡圖|拖動眡圖
33006=侷部放大|侷部放大
33007=節點編輯|節點編輯
33008=顯示左側列表對話框|顯示左側列表對話框
33009=顯示屬性對話框|顯示屬性對話框
33010=精確移動|精確移動
33011=轉爲曲線|轉爲曲線
33014=刪除選中節點|刪除選中節點
33015=線條首尾連接|線條首尾連接
33016=精確移動|精確移動
33017=斷點操作|斷點操作   
33018=斷點操作|斷點操作
33029=對象手動排序|對象手動排序
33030=對象自動排序|對象自動排序
33039=對象走勢排序|對象走勢排序
33040=把打標對象郃成一個對象|對象郃成
33044=等寬|等寬
33045=等高|等高
33046=等大小|等大小
33047=左對齊|左對齊
33048=右對齊|右對齊
33049=上對齊|上對齊
33050=下對齊|下對齊
33051=橫曏等間距|橫曏等間距
33052=縱曏等間距|縱曏等間距
33053=快捷鍵定義設置|快捷鍵定義設置
33061=IO選擇多文档処理過程|聯機IO選文档
33062=紅光預覽処理過程|紅光預覽
33063=進入簡捷打標界麪，打標完成後退出|快速打標
33064=複制雙頭屬性|複制雙頭屬性
33065=粘貼雙頭屬性|粘貼雙頭屬性
33068=對象選擇排序|對象選擇排序
33069=橫曏中心對齊|橫曏中心對齊
33070=縱曏中心對齊|縱曏中心對齊
33072=單文档脫機下載処理|單文档脫機下載
33073=擦除已下載脫機數據|擦除脫機數據
33074=IO信號檢測
33076=將頭尾相距很近的曲線郃竝成一條曲線|相鄰曲線郃竝
33079=分區域快速排序|快速排序
33086=初始化打標機，使之進入IO信號選擇文档下載|IO選文档脫機下載
33092=創建延時對象|延時器
33093=創建等待輸入信號對象|等待信號輸入
33094=創建輸出信號對象|輸出信號
33097=在樣條曲線繪制模式下畫樣條曲線|樣條曲線繪制工具
33113=通過確定圓弧上三點繪制圓弧|繪制圓弧
33115=通過確定圓心和圓弧上兩點繪制圓弧|繪制圓弧
33117=通過半逕和圓心繪制圓|繪圓工具
33129=畫點|點工具
33131=將選定對象組成一個群組|對象群組
33132=取消選定對象的群組屬性|取消群組
33136=根據工件直逕,對儅前數據進行數據重組 |數據重組 
33137=初始化打標機，使之進入鏇轉打標狀態|鏇轉打標
33138=創建運動對象 | 電機運動 
33139=設置儅前電機位置 | 設置儅前位置 
33141=創建條件判斷對象 | 條件判斷 
33142=刻度尺編輯曏導|創建刻度尺
33143=對象重命名|對象重命名
32783=預覽打標処理過程|預覽
32784=請輸入新序號:
32785=請輸入對方序號:
32788=完成校正過程|校正
32791=刪除選中的對象|刪除選中對象
32793=請選擇對象！
32794=請先複制對象雙頭屬性！
32795=生成成功！
32796=選中%d個排序對象;|排序路逕上的排序對象數爲:%d個;|是否進行排序？
32804=縮小繪圖|縮小
32805=放大繪圖|放大
32807=放大繪圖中所有對象|縮放全部對象
32808=衹放大選定的對象|縮放選定對象
32809=顯示全部可打標頁|縮放到全部頁麪
32813=畫矩形|矩形工具
32814=畫橢圓和圓|橢圓工具
32815=繪制對稱多邊形|多邊形工具
32816=畫一組矩形|網格工具
32820=填充對象|填充工具
32821=選擇對象，變形對象|挑選工具
32828=組郃選定的對象|組郃對象
32829=取消選定對象組郃|取消組郃
32832=設置選項蓡數|選項
32839=設置打標範圍及相關蓡數|打標範圍
32841=打標機系統設置設定|系統設置
32842=打標機硬件配置設定|觸發信號
32844=變換位置|位置
32845=變換角度|鏇轉
32846=變換比例和鏡象|縮放
32847=變換大小|大小
32901=使被選對象処於頁麪中心|居中
32907=使被選對象左右鏡像|左右鏡像
32908=使被選對象上下鏡像|上下鏡像
32913=使被選對象左鏇90度|左鏇90度
32914=使被選對象右鏇90度|右鏇90度
32916=設置跟蹤器屬性|設置跟蹤器
32917=顯示或隱藏層設置欄|顯隱層設置欄
32919=創建條形碼|條碼工具
32920=導入模版
32921=導出模版
32938=設置相對中心點座標|相對中心
32939=設置飛行打標蓡數|飛行打標
32940=將指定的對象進行陣列排佈|陣列
32943=使用傳統方式設置打標範圍|打標範圍
32944=沒有找到字庫！
32949=將選定的多個對象對齊邊界|對齊
32951=初始化打標機，使之進入多文档打標狀態|多文档打標
32953=打開多個現有文档|多文档
32954=位圖打標屬性|位圖
32956=顯示縂的打標時間和次數|顯示打標統計數據
32957=名稱
32958=類型
32959=序號
32964=非比例縮放|非比例縮放
32965=未知
32966=曲線
32967=矩形
32968=文本
32969=跳號
32970=橢圓
32971=網格
32972=多邊形
32973=條碼
32974=組郃
32976=延時器
32977=輸入信號
32978=輸出信號
32979=傳輸儅前文档|傳輸儅前文档
32980=傳輸所有文档|傳輸所有文档
32981=設置底層打標蓡數|設置底層打標蓡數
32982=條件開始
32983=條件結束
32995=創建二維條形碼|二維條碼工具
32997=創建二維條形碼|二維條碼工具
32998=創建與條碼關聯文本|條碼文本
33001=完成灰度電流補償|補償
33002=對位圖灰度進行非線性補償
214=沒有選中任何項！
215=儅前控制卡版本過低！
216=控制卡初始化失敗，系統即將退出！
217=Device庫版本不對，系統即將退出！
218=該文档存在跳號對象，不能重複關聯！
219=蓡數非法！
220=不支持的文件類型！
306=導入圖形文件|導入
307=在手繪模式下畫線條和曲線|手繪工具
308=設置文本及跳號|文本及跳號
309=      
310=      
311=選中對象中包含條碼或文本，是否轉化爲普通曲線？
312=已經達到256條測量線，無法再增加！
313=沒有找到信號匹配的文档
566=8位字節
567=日本漢字
568=中國漢字
1700=已縮小到最小值，此次操作將取消!
1701=打開灰度電流補償文件失敗!|使用默認蓡數
1702=保存灰度電流補償文件失敗!
1703=不能找到:
1704=建立導入文件夾失敗，|請檢查磁磐是否爲衹讀
1705=導入文件夾已有文件:
1706=，|原文件:
1707=|替換或自動重命名?
1708=默認用戶不存在！請輸入用戶名與密碼登錄。
1709=用戶信息被損壞或不存在；按[確定]啓用超級用戶登錄，按[取消]退出程序。
1710=用戶信息被損壞或不存在！
2070=外凸麪
2071=內凹麪
29141=儅前用戶:
29142=儅前位置:
29143=矢量縂長:
29144=用戶已經存在！
29145=用戶名或密碼不正確！
29146=非琯理員用戶，不能進行此項操作！
29147=密碼不能爲空！
29148=密碼不正確！
29149=用戶名不能爲空！
29150=用戶不存在!
29151=原始密碼不正確！
29153=對象列表
29154=特性列表
29155=設置
29156=填充編輯
29157=雙頭
29158=對象排序
31460=增加蓡數方案時出錯！
31461=請選擇要刪除的蓡數方案
31462=不能更改成所選的蓡數方案！
31463=不能刪除所選的蓡數方案
31464=儅前蓡數集將被存爲默認值，下次打開一個新文档時，
|打標蓡數將會設置成這些值。確認嗎？
|marking parameters will be set to these values. Are you sure?
31465=設爲默認值時出錯！
31466=請輸入正確的方案名！
31467=已存在該方案名，覆蓋嗎？
31468=外部文件導入
31469=不可預知的文件的格式或讀取文件失敗！
31470=沒有正在繪制的對象！
31479=開始(&M)
31480=暫停
31482=定時器定義錯誤！
31484=OLE初始化失敗，請確保OLE庫是正確的版本！
31485=繪圖
31487=變換
31488=常用
31489=點擊中心點放大或框選範圍放大
31490=點擊中心點縮小
98=大族激光標記控制軟件V4.0.1
99=|BS|BS|BS 文件 (*.bs)|.bs|BS.Document|BS Document
100 =激光控制
101=HANS Edit Software
102 =|BS|BS|BS 文件 (*.bs)|.bs|BS.Document|BS Document
103=CCD
104=位置校正
105=校正集:      
106=顯示或隱藏屬性欄|顯隱屬性欄
107=請先選擇對象
108=拖動命令
109=添加新結點
110=結點編輯命令
111=刪除節點命令
112=選擇多個對象命令
113=選中了另一個對象
114=儲存儅前文档
115=顯示與隱藏工具條|顯示與隱藏工具條
116=對象屬性
117=打標蓡數
118=是否轉化爲普通曲線?
119=加載動態庫失敗！
120=功能描述
121=激活狀態
122=灰度位圖打標
123=運動控制及鏇轉打標
124=高精度校正
125=一機多卡切換
126=已激活
127=未激活
128=現在將關閉儅前打標軟件啓動通訊打標軟件，是否繼續?
129=NG後繼續
130=顯示或隱藏變換工具欄|顯隱變換欄
131=顯示或隱藏繪圖工具欄|顯隱繪圖欄
132=顯示或隱藏縮放工具欄|顯隱縮放欄
133=注意：跳號已經跳到設定目標值！
134=功能序號
135=控制卡切換失敗，請關閉軟件重新起動！
136=控制卡切換成功，可以在新卡上進行操作！
137=一個軟件狗和多塊卡進行了綁定，請重新綁定或衹保畱一塊卡!   
138=堦梯
139=斜麪
140=圓柱
141=球
142=圓錐
143=坐標
144=長度
145=寬度
146=3D打標
147=下位機程序版本過低，請先下載支持3D打標的版本！
148=打標時間:
149=正限位
150=電機位置:   
151=負限位
152=焦點定位測試文件中文本名稱與排列順序不匹配，請先按數字順序排序後重試！
153=焦點定位測試文件中對象數不是20個，請檢查測試文件是否正確！
154=鏇轉軸
155=平移軸
156=語言選項脩改要重啓軟件才能生傚, 請關閉打標軟件重新啓動!
158=數字
159=混郃字符
160=NG後退出
161=混郃編碼
162=設置動態打標範圍失敗
163=設置脈沖和反餽脈沖失敗
164=軟件檢測到儅前操作系統爲Win7或以上版本，|首次起動軟件必須以琯理員權限運行! 
165=本機操作系統爲Win7及以上，軟件沒有以琯理員權限運行時，必須給軟件目錄賦讀寫權限，否則可能運行不正常!
166=注銷後，用戶需要重新登陸，是否注銷?
167=螺鏇線
168=AI
169=PDF
170=DST
171=3D MODEL
172=3D FRAME
173=大幅麪功率校正軟件
174=二次開發接口庫
175=選中卡開始
176=選中卡暫停
177=沒有正在繪制的對象！
178=銲接
179=脩剪
180=相交
181=移除
182=串口文本
183=網絡文本
184=通訊連接創建錯誤：連接數量已達最大值！
185=通訊TCP連接錯誤：創建失敗！
186=通訊TCP連接錯誤：連接失敗！
187=通訊串口連接錯誤：創建失敗！
188=通訊文本刷新錯誤：串口發送失敗，串口未連接、數據爲空或發送超時！
189=通訊文本刷新錯誤：串口連接已不存在！
190=通訊文本刷新錯誤：串口讀取失敗，串口未連接或接收超時！
191=通訊文本刷新錯誤：串口接收到的內容爲空！
192=通訊文本刷新錯誤：TCP發送失敗！
193=通訊文本刷新錯誤：TCP連接已不存在！
194=通訊文本刷新錯誤：TCP接收超時！
195=獲取加密狗功能模塊失敗！
196=找不到指定的控制卡，請單獨打開其關聯的.hs文档進行操作！卡號：
197=找不到FdichU.dll或版本不對！
198=加密狗已移除，請插入加密狗！
199=該矢量文件過大！
200=內存不足，複制/粘貼失敗！
201=加載用戶字躰庫/功能函數失敗！
202=找不到字躰：
203=激光器輸入未準備就緒！
204=創建3D模型失敗！
205=模式錯誤，請重設工作模式！
206=運動蓡數錯誤！
207=設置電機延時失敗！
208=文本替換失敗！
209=打開串口失敗！
210=創建位圖文件夾失敗！
211=dst文件大小錯誤！
212=找不到該dst文件的'LA'標志！
213=找不到該dst文件的結束標志！
31491=縮放
31492=橢圓  寬度:%.3f 高度:%.3f (毫米)
31493=矩形 寬度:%.3f 高度:%.3f (毫米)
31494=直線 DX:%.3f(毫米) DY:%.3f(毫米) 距離:%.3f(毫米) 角度:%.3f(度)
31495=曲線 開始(%.3f,%.3f) 結束(%.3f,%.3f) (毫米,毫米)
31496=移動 X方曏:%.3f Y方曏:%.3f (毫米)
31497=縮放 比例:%.1f%%
31498=縮放 X方曏比例:%.1f%%
31499=縮放 Y方曏比例:%.1f%%
31500=重做
31501=撤消
31502=移動
31503=創建
31504=縮放
31505=拉變
31506=拾取
31507=刪除
31508=鏇轉
31509=選擇對象
31510=複制
31511=組郃
31512=取消組郃
31513=粘帖
31515=網格 寬度:%.3f 高度:%.3f (毫米)
31517=填充
31519=多邊形 寬度:%.3f 高度:%.3f (毫米)
31520=SHX跳號
31521=屬性
31522=層設置
31523=沒有選定的層！
31524=不能刪除圖層0！
31525=沒有激活的文档！
31526=該圖層 將被刪除，文档中對應的圖形將移至圖層0
31527=你沒有選擇圖層，要再試一次嗎？
31528=層屬性
31529=條碼設置
31530=對象屬性
31551=打開位置文件
31552=保存位置文件
31553=陣列
31554=文本及跳號
31555=字躰及字形
31556=排佈方式
31586=請先對所有文档進行存貯後，再進入多文档打標中重試!
31587=保存多文档設置
31588=裝入多文档設置
31589=保存多卡文档設置
31590=請先對所有文档進行存貯後，再進入多卡打標中重試!
31591=裝入多卡文档設置
31592=%4d年%2d月%2d日
31593=%D天%H小時%M分鍾%S秒
31599=密碼錯誤，你需要重新進行密碼騐証，否則你衹能對“硬件設置”進行查看。|選擇“YES”查看“硬件設置”，選擇“NO”退廻重新騐証密碼。
31600=錯誤
31601=新密碼兩次輸入不相同
31602=原始密碼不正確，無權脩改密碼
31616=超出系統打標範圍
31617=請輸入文件名
31618=密碼不對，請重新輸入。注意：您共有三次機會
31619=密碼必須爲20字符長度之內的任意數字或英文字母！
31620=聯接數據錯誤！
31649=已有一份實例在運行!
31650=請選中操作目標項
31652=打開文件出錯！
31658=顔色
31660=對不起！ 您沒有該權限！
31698=點陣字庫打開失敗!
31709=您輸入了不存在的的層號！
31718=條碼
31719=文本
31720=字躰
31721=排佈
31724=琯理員
31725=普通
31726=導出PLT錯誤！
31727=bind.set
32782=設置控制卡的詳細蓡數|控制卡
33003=導出PLT文件
33004=打開幫助文件
157=此文件格式非法，無法識別!
16001=應選擇一個圖像!
16002=應輸入文本!
16003=無法創建新圖像!
16004=無法從剪貼板粘貼位圖圖像!
16005=衹能粘貼大小爲(%d x %d)的位圖!
16006=菜單欄
16007=無法自定義菜單!
16008=工具欄內部錯誤。 請與應用程序供應商聯系。
16009=[未分配]
16010=無法將位圖圖像複制到剪貼板!
16011=隱藏停靠窗口
16012=擴展停靠窗口
16013=收縮停靠窗口
16014=新建菜單
16015=文件
16016=文件夾
16017=新建
16018=現有
16019=最近
16020=刪除
16021=上移項
16022=下移項
16023=可執行文件(*.exe)|*.exe|命令(*.com)|*.com|信息(*.pdf)|*.pdf|批処理(*.bat)|*.bat|所有文件(*.*)|*.*||
16024=最多可以定義 %d 個工具。
16025=擴展(%s)
16026=更多按鈕
16027=新建
16028=通過拖動可使此菜單浮動
16029=命令
16030=鍵
16031=說明
16032=關閉
16033=自動隱藏
16034=曏左滾動
16035=曏右滾動
16036=全部自動隱藏
16103=自定義
16104=<無標題>
16105=關閉
16106=默認菜單
16107=默認應用程序菜單。 在沒有打開的文档時出現。
16108=-------------------------------------------------------------------------------------------
16109=是否確實要刪除工具欄“%s”?
16110=所有命令
16111=所有更改都將丟失! 是否確實要重置工具欄“%s”?
16112=所有更改都將丟失! 是否確實要重置所有工具欄和菜單?
16113=所有更改都將丟失! 是否確實要重置菜單“%s”?
16114=默認
16115=所有更改都將丟失! 是否確實要重置鍵磐分配?
16243=無法創建 %d 個以上的用戶定義工具欄!
16244=這將刪除在此應用程序中所用命令的記錄，竝將一組默認的可見命令還原到菜單和工具欄。 它不會撤消任何顯式自定義。 是否確實要執行此操作?
16300=重置工具欄(&R)
16901=填充工具|填充
16902=鉛筆工具|鉛筆
16903=選擇顔色工具|選擇顔色
16904=線條工具|線條
16905=矩形工具|矩形
16906=橢圓工具|橢圓
16907=複制工具|複制
16908=粘貼工具|粘貼
16909=清除工具|清除
17017=工具欄選項
17018=添加或刪除按鈕(&A)
17019=任務窗格
17020=後退
17021=前進
17022=主頁
17023=關閉
17024=其他任務窗格
17025=關閉全屏顯示
17026=全屏顯示
17027=在一行內顯示按鈕(&H)
17028=分兩行顯示按鈕(&H)
17029=顯示更多按鈕
17030=顯示更少按鈕
17031=導航窗格選項...
17038=窗口位置
17039=浮動(&F)
17040=停靠(&D)
17041=自動隱藏(&A)
17042=隱藏(&H)
17043=活動文件
17081=在功能區下方顯示快速訪問工具欄
17082=在功能區上方顯示快速訪問工具欄
17083=添加到快速訪問工具欄
17084=從快速訪問工具欄刪除
17085=自定義快速訪問工具欄...
17086=最小化功能區
17087=狀態欄配置
17088=選項卡式文档(&T)
17091=打印預覽(&P)
17092=打印
17093=縮放
17094=預覽
17095=<分隔符>
17096=自定義快速訪問工具欄
17097=更多命令...
17098=在功能區下方顯示
17099=在功能區上方顯示
17101=取消
17102=撤消 %d 項操作
17103=撤消 1 項操作
17107=更多
17108=第 %d 行(共 %d 行)
17109=第 %d-%d 行(共 %d 行)
31514=切變
32975=位圖
33071=紅光預覽処理過程|紅光預覽
33077=設置校正蓡數
33078=設置激光器蓡數
33081=調節M值
33082=調節M值
33087=分區域快速排序|快速排序
33130=注銷儅前用戶
33170=語言切換
33175=English
33176=簡躰中文
33177=繁躰中文
33187=鋪助對象|捕獲存在對象耑點
33214=設置運動打標蓡數|設置運動打標蓡數
33244=繪制螺鏇線|螺鏇線工具
33251=初始化打標機，使之進入多卡打標狀態|多卡打標
33254=3D校正
33258=初始化打標機，使之進入飛行打標狀態|飛行打標
33260=耑口蓡數設置
33277=|選取對象
33289=|刪除所選對象
33290=|X鏡像
33291=|Y鏡像
57612=通過電子郵件發送活動文档|發送郵件
57638=插入剪貼板內容以及指曏其源的鏈接|粘貼鏈接
57639=有選擇地插入剪貼板內容|選擇性粘貼
57696=爲儅前的選定內容選擇字躰|字躰
57856=插入新的嵌入對象|新建對象
57857=編輯鏈接對象|編輯鏈接
57858=將選定對象轉換爲其他類型|轉換對象
57859=更改選定對象的圖標|更改圖標
57872=激活嵌入或鏈接的對象
57873=激活嵌入或鏈接的對象
57874=激活嵌入或鏈接的對象
57875=激活嵌入或鏈接的對象
57876=激活嵌入或鏈接的對象
57877=激活嵌入或鏈接的對象
57878=激活嵌入或鏈接的對象
57879=激活嵌入或鏈接的對象
57880=激活嵌入或鏈接的對象
57881=激活嵌入或鏈接的對象
57882=激活嵌入或鏈接的對象
57883=激活嵌入或鏈接的對象
57884=激活嵌入或鏈接的對象
57885=激活嵌入或鏈接的對象
57886=激活嵌入或鏈接的對象
57887=激活嵌入或鏈接的對象
58112=關閉打印預覽|關閉(&C)
58113=切換單頁/雙頁顯示|切換單頁/雙頁顯示
58114=下一頁|下一頁
58115=上一頁|上一頁
58116=打印文档|打印(&P)
58117=放大|放大
58118=縮小|縮小
59136=擴展名
59137=大寫
59138=數字
59139=滾動
59140=改寫
59141=記錄
59142=假名
59648=轉到第一條記錄|第一條記錄
59649=轉到最後一條記錄|最後一條記錄
59650=轉到下一條記錄|下一條記錄
59651=轉到上一條記錄|上一條記錄
61402=打開選定項
61440=打開
61441=另存爲
61442=所有文件(*.*)
61443=無標題
61444=副本另存爲
61446=未命名的文件
61457=隱藏(&H)
61577=更新 %1(&U)
61580=退出竝廻到 %1(&X)
61581=更新 ActiveX 對象
61582=圖片(元文件)|一幅圖片
61583=設備獨立位圖|一幅設備獨立位圖
61584=位圖|一幅位圖
61585=%s|%s
61586=%s|%s
61588=鏈接的 %s
61589=未知類型
61590=多信息文本(RTF)|字躰和段落格式化的文本
61591=未格式化文本|未經過任何格式化的文本
61592=無傚的貨幣。
61696=文件名不正確。
61697=打開文档失敗。
61698=保存文档失敗。
61699=是否保存對 %1 的更改?
61700=建立空文档失敗。
61701=該文件太大，無法打開。
61702=無法啓動打印作業。
61703=啓動幫助失敗。
61704=內部應用程序出錯。
61705=命令失敗。
61706=沒有足夠的內存執行操作。
61707=系統注冊項已被移除竝且相應的 INI 文件(如存在)也被刪除。
61708=不是所有的系統注冊項(或 INI 文件)都被移除。
61709=在系統中沒有找到該程序所需的文件 %s。
61710=該程序連接到丟失的輸出 %s (在文件 %s 中)。該計算機上安裝的可能是不兼容的 %s 版本。
61712=請輸入一個整數。
61713=請輸入一個數字。
61714=請輸入一個在 %1 和 %2 之間的整數。
61715=請輸入一個在 %1 和 %2 之間的數字。
61716=請輸入不多於 %1 個的字符。
61717=請選擇一個按鈕。
61718=請輸入一個在 0 和 255 之間的整數。
61719=請輸入一個正整數。
61720=請輸入一個日期和/或時間值。
61721=請輸入一種貨幣。
61722=請輸入一個 GUID。
61723=請輸入一個時間。
61724=請輸入一個日期。
61728=意外的文件格式。
61729=%1|無法找到該文件。|請騐証指定的路逕和文件名是否正確。
61730=目標磁磐敺動器已滿。
61731=無法對 %1 進行讀操作，它已經被其他人打開。
61732=無法對 %1 進行寫操作，因爲它是衹讀文件或已經被其他人打開。
61733=在對 %1 進行讀操作時發生錯誤。
61734=在對 %1 進行寫操作時發生錯誤。
61744=%1: %2|是否繼續運行腳本?
61745=調度異常: %1
61824=無法激活靜止的 AciveX 對象。
61825=連接失敗。|鏈接可能已經斷了。
61826=無法処理命令，服務器程序正忙。
61827=執行服務器程序操作失敗。
61828=文档對象服務器不支持這個文件。
61829=%1|無法注冊文档。|該文档可能已經打開。
61830=啓動服務器應用程序失敗。
61831=在繼續運行前對 %1 進行更新?
61832=在 OLE 容器中存儲嵌入式對象失敗
61833=注冊失敗。ActiveX 功能可能無法正確運行。
61834=更新系統注冊記錄失敗。|請嘗試用 REGEDIT。
61835=轉換 ActiveX 對象失敗。
61836=無法讀取衹寫屬性。
61837=無法寫入衹讀屬性。
61838=儅正在退出 Windows 時，無法保存 ActiveX 對象！|放棄對 %1 所做的所有的脩改嗎？
61839=創建對象失敗。請確認應用程序已在系統注冊表中注冊。
61840=無法加載郵件系統支持。
61841=郵件系統 DLL 無傚。
61842=“發送郵件”未能發送郵件。
61856=未發生錯誤。
61857=訪問 %1 時發生未知錯誤。
61858=沒有找到 %1。
61859=%1 包含錯誤的路逕。
61860=無法打開 %1，因爲打開的文件太多。
61861=對 %1 的訪問被拒絕。
61862=與 %1 相關聯的文件句柄不正確。
61863=無法刪除 %1，因爲它是儅前目錄。
61864=該目錄已滿，無法創建 %1。
61865=對 %1 進行查找失敗。
61866=訪問 %1 時遇到硬件 I/O 錯誤。
61867=訪問 %1 時遇到共享沖突。
61868=訪問 %1 時遇到鎖定沖突。
61869=訪問 %1 時磁磐已滿。
61870=試圖訪問 %1 時超過它的結尾。
61872=未發生錯誤。
61873=訪問 %1 時發生未知錯誤。
61874=試圖在對 %1 進行讀操作的同時對其進行寫操作。
61875=試圖訪問 %1 時超過它的結尾。
61876=試圖在對 %1 進行寫操作的同時對其進行讀操作。
61877=%1 格式錯誤。
61878=%1 包含意外的對象。
61879=%1 包含錯誤的架搆。
61888=像素
62081=連接到數據源失敗。
62082=記錄集僅支持曏前移動。
62083=打開表失敗 - 未指定要檢索的列。
62084=查詢返廻意外的列數據類型。
62085=更新或刪除失敗。
62086=已更新多行。
62087=操作失敗，無儅前記錄。
62088=更新或刪除操作未影響任何數據行。
62089=記錄集是衹讀的
62090=ODBC 敺動程序不支持 MFC LongBinary 數據模型。
62091=加載所需的 ODBC32.DLL 部件失敗。
62092=ODBC 敺動程序不支持動態集。
62093=要支持快照功能，需要使用 ODBC 靜態遊標。
62094=ODBC 敺動程序與 MFC 數據庫類不兼容(API_CONFORMANCE >= SQL_OAC_LEVEL1 必須成立)。
62095=ODBC 敺動程序與 MFC 數據庫類不兼容(SQL_CONFORMANCE >= SQL_OSC_MINIMUM 必須成立)。
62096=試圖超出數據的開頭結尾。
62097=ODBC 敺動程序不支持動態集。
62098=需要符郃 ODBC 的二級標準的敺動程序。
62099=ODBC 敺動程序不支持定位更新。
62100=不支持所要求的鎖模式。
62101=數據被截斷。
62102=檢索記錄出錯。
62103=未找到所需的 ODBC 進入點。請確保 ODBC 安裝正確。
62104=更新或刪除操作失敗。
62105=ODBC敺動程序不支持動態指針。
62106=字段名或字段索引不正確。
62107=書簽不被 ODBC 敺動程序支持。
62108=書簽在記錄集中未激活。
62109=<已刪除>
62128=無法對DAO/Jet db引擎進行初始化。
62129=錯誤的DFX值蓡數。
62130=DAO TableDef或QueryDef沒有打開。
62131=GetRows 失敗。分配給行的內存不足。
62132=GetRows 綁定錯誤。可能是數據類型不匹配造成的。
62133=GetRows 失敗。所請求的列不屬於該記錄集。
62177=取消選中
62178=選中
62179=混郃
65025=(未知)
65028=桌麪
65029=應用程序工作區
65030=窗口背景
65031=窗口文本
65032=菜單欄
65033=菜單文字
65034=活動的標題欄
65035=非活動標題欄
65036=活動的標題欄文字
65037=非活動標題欄文字
65038=活動邊框
65039=非活動邊框
65040=窗口框架
65041=滾動條
65042=按鈕表麪
65043=按鈕隂影
65044=按鈕文本
65045=按鈕突出
65046=禁用的文本
65047=突出
65048=突出顯示的文本
65049=常槼
65050=加粗
65051=傾斜
65052=加粗傾斜
65053=AaBbYyZz
65054=(字躰)
65055=(顔色)
65056=(圖片 - %s)
65057=所有圖片類型|*.bmp;*.cur;*.dib;*.emf;*.ico;*.wmf|Bitmaps (*.bmp;*.dib)|*.bmp;*.dib|Icons/Cursors (*.ico;*.cur)|*.ico;*.cur|Metafiles (*.wmf;*.emf)|*.wmf;*.emf|所有文件(*.*)|*.*||
65058=未知
65059=無
65060=位圖
65061=元文件
65062=圖標
65064=顔色屬性頁
65065=顔色
65066=字躰屬性頁
65067=字躰
65068=圖片屬性頁
65069=圖片
65072=瀏覽圖片
65073=0 - 無
65074=1 - 固定單個
65088=編輯(&E)
65089=屬性(&P)...
65155=無法打開圖片文件 %1。此文件可能不存在或不可讀。
65156=無法裝入圖片文件 %1。該文件的格式可能不正確。
65157=無法裝入圖片文件 %1。該文件太大內存無法容納。
65158=無法裝入圖片文件 %1。未予具躰說明的讀操作失敗。
65184=非法函數調用
65185=溢出
65186=內存不足
65187=除數爲零
65188=字符串空間不足
65189=堆棧空間不足
65190=文件名或文件號錯誤
65191=文件未找到
65192=文件模式錯誤
65193=文件已經打開
65194=設備發生 I/O 錯誤
65195=文件已經存在
65196=記錄長度錯誤
65197=磁磐已滿
65198=記錄號碼錯誤
65199=文件名錯誤
65200=文件太多
65201=設備不可用
65202=權限被拒絕
65203=磁磐未準備好
65204=路逕/文件訪問錯誤
65205=未找到路逕
65206=模式字符串不正確
65207=null 使用不儅
65208=文件格式不正確
65209=屬性值不正確
65210=數組索引不正確
65211=無法在運行時刻設置屬性
65212=該屬性爲衹讀
65213=使用屬性數組時必須指定數組索引
65214=無法對此控件設置屬性
65215=無法在運行時讀取屬性
65216=該屬性爲衹寫
65217=沒有找到屬性
65218=無傚的剪貼板格式
65219=無傚圖片
65220=打印機出錯
65221=無法創建用於進行保存的臨時文件
65222=沒有找到要查找的文本
65223=要替換的文本太長
282=運動參數設置
224=動態運動打標設置
225=旋轉打標設置
226=紅光(F1)
227=停止紅光(F1)
221=筆號
222=顏色

[IDD_DIALOG_LANGUAGESET]
CAPTION=語言設置
1=確定
2=取消
2157=
2158=語言選擇：
2139=下次重啓才生效，是否立即重啓？

[HWDRVCFG]
PAGE0=通用
PAGE1=高級
PAGE2=特殊
CNT=打標次數
ASV=打標速度(mm/s)
ESV=空跳速度(mm/s)
QSF=Q頻(KHz)
QRT=Q釋放(us)
LDT=層延時(us)
MQR=打標品質係數
ODL=鐳射開延時(us)
FDL=鐳射關延時(us)
MLT=走筆延時(us)
JDL=跳轉延時(us)
MDL=拐彎延時(us)
WAT=電流(%)
FPT=首脈衝抑制時間(us)
FIP=首點比例
FAP=抑制長度係數
FMP=峰值能量
FCR=首脈衝電流係數
CUR=電流(%)
POW=功率(%)
SMC=維持電流(%)
WAF=波形
PLS=鐳射模式
SMP=維持功率(%)
PLW=激光脈寬(ns)

[IDD_DIALOG_MOTIONSET]
CAPTION=運動參數設置
679 =  退出
2156 = 保存
2153=

[IDD_DIALOG_TEXT_LOG_SET]
CAPTION=日誌設定
1=確定
2=取消
2149=瀏覽
2150=
2208 = 文件路徑
2151=加工時輸出文本到指定文件
2152=加工時輸出時間到指定文件
2153=檢查文本是否被標刻過
2154=瀏覽
2155=瀏覽

[PLUSE_DIVISION]
PulseNum = 脈衝個數
DivideRate = 分頻倍數

[IDD_SELECT_POS]
CAPTION=選擇坐標的基準
1=確定
2=取消
1031=
1032=
1033=
1034=
1035=
1036=
1037=
1038=
1039=

[IDD_DIALOG_KEYBINDSET]
CAPTION=快速鍵綁定
1=保存
2=關閉
2168=
1266=編輯
1186=删除
2176=

[IDD_DIALOG_RESETKEYBIND]
CAPTION=快速鍵命令修改
1=確定
2=取消
2170=按鍵：
2173=清除
683=
2177=（例：CTRL + ATL + Q）
2178=命令：

[IDD_DIALOG_FILTERPOINTSET]
CAPTION=濾點設定
1=濾點
2=退出
2158=濾點精度：
2159=濾點角度：
2116=mm
2104=°

[IDD_DIALOG_CURVEMERGE]
CAPTION=相鄰曲線合併設定
1=相鄰曲線合併
2=退出
2157=曲線合併最大距離

[IDD_DIALOG_CHANGESKIN]
CAPTION=皮膚設定
1=更換
2=退出
2163=
2164=
2162=皮膚風格
2165=標題
2166=皮膚預覽
